<p style="text-align: justify;"><span style="color: #000000;"><span style="font-size: 14pt;"><strong><span style="font-family: verdana, geneva;">Corre&ccedil;&otilde;es e implementa&ccedil;&otilde;es Do CIEvolution [6.2.19]</span></strong></span><img style="float: right;" src="https://s3.amazonaws.com/movidesk-files/14C591A7BA42EE3CF2A6443B297D31B5" alt="420x272 s&oacute; logo.jpg" width="227" height="147" /></span></p>
<p style="text-align: justify;"><span style="color: #000000;">&nbsp;</span></p>
<p style="text-align: justify;"><span style="color: #000000;">&nbsp;</span></p>
<p style="text-align: justify;"><span style="color: #000000;">&nbsp;</span></p>
<p><span style="font-family: verdana, geneva; font-size: 12pt; color: #000000;">LEGENDA:</span></p>
<p><span style="font-family: verdana, geneva; font-size: 12pt; color: #000000;"><strong>S =</strong> Solicita&ccedil;&atilde;o&nbsp;</span></p>
<p><span style="color: #000000; font-family: verdana, geneva; font-size: 12pt;">&nbsp;</span></p>
<p><span style="color: #000000; font-family: verdana, geneva; font-size: 12pt;"><strong>Melhorias:</strong></span></p>
<p><span style="font-family: verdana, geneva; font-size: 12pt;"><span style="color: #000000;"><strong>S= 23375,&nbsp;</strong>Implementado as rotinas&nbsp;pr&oacute;prias que possui valor de frete com o tipo "CIF",&nbsp;</span><span style="color: #000000;">o valor do frete ir&aacute; compor a base de calculo do ICMS, ICMS Substitu&iacute;do e Difal.</span></span></p>
<p><span style="color: #000000; font-family: verdana, geneva; font-size: 12pt;"><strong>S= 27083,&nbsp;</strong>Implementado ao cadastro de produto aba Dados Fiscais os campos "Ex.ipi" e "G&ecirc;nero Item",&nbsp;quando preenchidos ser&atilde;o replicados para&nbsp;registro E0200. O preenchimentos dos campo no EFD - Fiscal s&atilde;o facultativos.&nbsp;</span></p>
<p><span style="color: #000000; font-family: verdana, geneva; font-size: 12pt;"><img src="https://s3.amazonaws.com/movidesk-files/FBA43AD0EFAAB66014EC96F5552634B0" /></span></p>
<p><span style="color: #000000; font-family: verdana, geneva; font-size: 12pt;">&nbsp;</span></p>
<p><span style="font-family: verdana, geneva; font-size: 12pt; color: #000000;"><strong>S=&nbsp;27095,</strong> Adicionado a gera&ccedil;&atilde;o do arquivo EFD - Fiscal o preenchimento do registro C110,&nbsp;o&nbsp;registro &eacute; facultativo e ser&aacute; preenchido com&nbsp;informa&ccedil;&otilde;es complementares&nbsp;&nbsp;de notas fiscais de terceiro.&nbsp;</span></p>
<p><span style="font-family: verdana, geneva; font-size: 12pt; color: #000000;"><strong>S= 453,</strong> Implementado ao menu ajuda o submenu Artigos,&nbsp;no menu foram inclusos artigos&nbsp;sobre os produtos Conceito e artigos fiscais.&nbsp;</span></p>
<p><span style="font-family: verdana, geneva; font-size: 12pt; color: #000000;"><strong>S =&nbsp;27140,&nbsp;</strong>Incluso valida&ccedil;&atilde;o em acerto de estoque para obrigar definir grade em produtos que&nbsp;possui&nbsp;grade.</span></p>
<p><span style="font-family: verdana, geneva; font-size: 12pt; color: #000000;"><strong>S= 27097, </strong>Na busca padr&atilde;o "lupa" j&aacute; possu&iacute;a&nbsp;uma rotina para usu&aacute;rio privilegiado, os usu&aacute;rios privilegiados podiam acessar a busca padr&atilde;o e ocultar colunas, uma vez a coluna ocultada apenas usu&aacute;rios definidos como privilegiados podiam desocultar. </span></p>
<p><span style="font-family: verdana, geneva; font-size: 12pt; color: #000000;">Realizados melhorias no recurso:</span></p>
<ul>
<li><span style="font-family: verdana, geneva; font-size: 12pt;">&nbsp;</span><span style="font-family: verdana, geneva; font-size: 12pt; color: #000000;">As colunas ocultadas ser&atilde;o removidas da lista de campos dispon&iacute;veis para procura (Exceto usu&aacute;rio privilegiado);</span></li>
<li><span style="font-family: verdana, geneva; font-size: 12pt; color: #000000;">Troca de ordem de colunas afetar&aacute; a ordem dos campos dispon&iacute;veis para procura;</span></li>
<li><span style="font-family: verdana, geneva; font-size: 12pt; color: #000000;">A&ccedil;&otilde;es devem ocorrer imediatamente sem necessidade de fechar e abrir tela.</span></li>
</ul>
<p><span style="font-family: verdana, geneva; font-size: 12pt; color: #000000;">Observa&ccedil;&atilde;o: Caso usu&aacute;rio privilegiado necessite ocultar uma coluna apenas para seu pr&oacute;prio usu&aacute;rio, deve usar o recurso bot&atilde;o direito do mouse "ocultar coluna", a op&ccedil;&atilde;o ir&aacute; ocultar a coluna apenas para usu&aacute;rio logado.</span></p>
<p><span style="color: #000000; font-family: verdana, geneva; font-size: 12pt;"><strong>S= 27078,</strong> &nbsp;A importa&ccedil;&atilde;o de XML possui recurso para trocar as al&iacute;quotas&nbsp;de p&iacute;s e cofins, ajuste no sistema para&nbsp;zerar a base de calculo de pis/cofins quando for zerado as al&iacute;quotas.</span></p>
<p><span style="color: #000000; font-size: 12pt; font-family: verdana, geneva;"><strong>S= 27230,</strong> Implementado rotina uso de cr&eacute;dito "Vale-Compra" Nota fiscal diversa:</span></p>
<ul>
<li><span style="color: #000000; font-size: 12pt; font-family: verdana, geneva;">Valida&ccedil;&atilde;o ao gerar documento em nota fiscal diversa, quando for usado a forma de pagamento cr&eacute;dito "Vale-Compra" o sistema validar&aacute; se parceiro possui saldo de cr&eacute;dito suficiente;</span></li>
<li><span style="color: #000000; font-size: 12pt; font-family: verdana, geneva;">Documento faturado em nota fiscal diversa com forma de pagamento cr&eacute;dito "Vale-Compra", ser&aacute; lan&ccedil;ado na rotina Cr&eacute;dito uma movimenta&ccedil;&atilde;o do tipo D&eacute;bito referente ao valor do cr&eacute;dito utilizado.</span></li>
</ul>
<p><span style="font-family: verdana, geneva; font-size: 12pt;"><span style="color: #000000;"><strong>S= 26875,</strong> Em controle de entrega foi adicionado valida&ccedil;&atilde;o que verificar&aacute; se documento&nbsp;ainda est&aacute; ativo, a valida&ccedil;&atilde;o ocorrer&aacute; ao filtrar</span><span style="color: #000000;">&nbsp;o documento e ao confirmar entrega.</span></span></p>
<p><span style="color: #000000; font-family: verdana, geneva; font-size: 12pt;"><strong>S=&nbsp;27177, </strong>Adicionado novos CSTs a rela&ccedil;&atilde;o que dispara o calculo do ICMS ST "05 - Pauta":<br />(010, 110, 210, 310, 410, 510, 610, 710, 810).&nbsp;</span></p>
<p><span style="font-family: verdana, geneva; font-size: 12pt;">&nbsp;</span><span style="color: #000000; font-family: verdana, geneva; font-size: 12pt;"><strong>S=&nbsp;431,&nbsp;</strong>Implementado pagina&ccedil;&atilde;o de dados&nbsp;Procura/Pesquisa padr&atilde;o, a ideia &eacute; personalizar a exibi&ccedil;&atilde;o e tamb&eacute;m reduzir o trafego dos dados por requisi&ccedil;&atilde;o.</span></p>
<p><span style="color: #000000; font-family: verdana, geneva; font-size: 12pt;">Abaixo a pesquisa padr&atilde;o com pagina&ccedil;&atilde;o.</span></p>
<p><span style="color: #000000; font-family: verdana, geneva; font-size: 12pt;"><img src="https://s3.amazonaws.com/movidesk-files/5821B0EC4D415219505CA93EA7CAACB9" /></span></p>
<p><span style="color: #000000; font-family: verdana, geneva; font-size: 12pt;">Para ativar o recurso &eacute; necess&aacute;rio acionar o suporte.</span></p>
<p><span style="font-family: verdana, geneva; font-size: 12pt;"><strong><span style="color: #000000;">S= 27029,</span></strong><span style="color: #000000;">&nbsp;</span><span style="color: #000000;">A baixa de titulo a receber tratava a liquida&ccedil;&atilde;o de t&iacute;tulos com forma de pagamento com tipo cart&atilde;o cr&eacute;dito/debito como se fosse avista, ou seja, as liquida&ccedil;&otilde;es de t&iacute;tulos&nbsp;com forma do tipo cart&atilde;o n&atilde;o movimentavam o controle de cart&atilde;o.&nbsp;Alterado o sistema&nbsp;para as liquida&ccedil;&otilde;es de t&iacute;tulos&nbsp;com forma do tipo cart&atilde;o movimentar o controle de cart&atilde;o.&nbsp;</span><span style="color: #000000;">Os dados da administradora e c&oacute;digo de autoriza&ccedil;&atilde;o ser&atilde;o requisitados ao processar baixa do titulo,&nbsp;Assim como j&aacute;&nbsp;ocorria&nbsp;no faturamento da venda.</span></span></p>
<p><span style="font-family: verdana, geneva; font-size: 12pt;"><span style="color: #000000;">A liquida&ccedil;&atilde;o do titulo a partir da forma de pagamento cart&atilde;o cr&eacute;dito/debito, ser&aacute; liquidado o titulo e lan&ccedil;ado registro em transa&ccedil;&otilde;es</span><span style="color: #000000;">&nbsp;de cart&atilde;o.&nbsp;&nbsp;</span></span></p>
<p><span style="font-size: 12pt; font-family: verdana, geneva;"><span style="color: #000000;">O sistema tem um par&acirc;metro em "ini" que define se haver&aacute; concilia&ccedil;&atilde;o de cart&atilde;o, quando estiver definido para conciliar, ser&aacute; lan&ccedil;ado apenas um&nbsp;registro em transa&ccedil;&otilde;es de cart&atilde;o.</span></span></p>
<p><span style="font-size: 12pt; font-family: verdana, geneva;"><span style="color: #000000;">Caso esteja configurado para n&atilde;o conciliar, ser&atilde;o gerados dois lan&ccedil;amentos, um em transa&ccedil;&otilde;es de cart&atilde;o e outro no caixa o qual foi feito a liquida&ccedil;&atilde;o do t&iacute;tulo.</span></span></p>
<p><span style="font-size: 12pt; font-family: verdana, geneva;"><span style="color: #000000;">A liquida&ccedil;&atilde;o do titulo a receber com forma de pagamento do tipo cart&atilde;o, dispon&iacute;vel apenas em Financeiro-Caixa.</span></span></p>
<p><span style="font-size: 12pt; font-family: verdana, geneva;"><span style="color: #000000;">Estorno de titulo a receber com forma de pagamento do tipo Cart&atilde;o:</span></span></p>
<ul>
<li><span style="font-family: verdana, geneva; font-size: 12pt;">&nbsp;</span><span style="font-size: 12pt; font-family: verdana, geneva;"><span style="color: #000000;">O estorno s&oacute; ser&aacute; poss&iacute;vel ap&oacute;s a transa&ccedil;&atilde;o de cart&atilde;o for cancelada;</span></span></li>
<li style="text-align: justify;"><span style="font-size: 12pt; font-family: verdana, geneva;"><span style="color: #000000;">Caso esteja configurado para n&atilde;o conciliar, o sistema far&aacute; estorno no caixa referente ao lan&ccedil;amento da liquida&ccedil;&atilde;o;</span></span></li>
<li style="text-align: justify;"><span style="color: #000000; font-family: verdana, geneva; font-size: 12pt;">Se caixa estiver fechado e esteja configurado para n&atilde;o conciliar, o sistema solicitar&aacute; ao usu&aacute;rio no processo de estorno uma conta bancaria para estornar o valor.</span></li>
</ul>
<p><span style="font-family: verdana, geneva; font-size: 12pt;">&nbsp;</span></p>
<p><span style="color: #000000; font-family: verdana, geneva; font-size: 12pt;"><strong>Corre&ccedil;&otilde;es:</strong></span></p>
<p><span style="color: #000000; font-family: verdana, geneva; font-size: 12pt;"><strong>S= 27081,</strong>&nbsp;Na&nbsp;importa&ccedil;&atilde;o do XML s&atilde;o carregadas as parcelas conforme declarado no XML, o preenchimentos das tags por parte do emissor da NF-e s&atilde;o inconstantes, a falta de padr&atilde;o do preenchimentos dessas tags causam&nbsp;falhas na importa&ccedil;&atilde;o das parcelas. Afim de auxiliar e melhorar a experi&ecirc;ncia do usu&aacute;rio, foi implementado valida&ccedil;&atilde;o para verificar se a soma total das parcelas est&aacute; de acordo com total da NF-e. Caso o total das parcelas seja superior ao total, foi disponibilizado um bot&atilde;o para excluir as parcelas que excedem.</span></p>
<p><span style="color: #000000; font-family: verdana, geneva; font-size: 12pt;"><strong>S= 26433,</strong> Baixas de t&iacute;tulos realizadas no Caixa com forma de pagamento Cheque contendo troco em dinheiro, ao fazer o estorno dos t&iacute;tulos os cheques eram cancelados e os t&iacute;tulos reabertos, por&eacute;m na movimenta&ccedil;&atilde;o do caixa o d&eacute;bito do troco ainda persistia. Corrigido para que o troco tamb&eacute;m&nbsp;seja&nbsp;estornado.</span></p>
<p><span style="color: #000000; font-family: verdana, geneva; font-size: 12pt;"><strong>S= 27079,&nbsp;</strong>Na Importa&ccedil;&atilde;o do XML possui caixa de sele&ccedil;&atilde;o "ipi" quando marcada zera o valor e agrega em outras despesas, a fun&ccedil;&atilde;o estava com falha, o sistema s&oacute; estava zerando quando a outra caixa de sele&ccedil;&atilde;o "ICMS ST" estava marcada. Falha corrigida.&nbsp;</span></p>
<p>&nbsp;</p>
<p><span style="font-size: 12pt;"><strong><span style="color: #000000; font-family: verdana, geneva;">Em casos de duvidas os analistas de suporte estar&atilde;o a disposi&ccedil;&atilde;o para esclarecimentos!</span></strong></span></p>
