<div style="line-height: 150%; margin: 0cm 0cm 8pt; font-size: 11pt; font-family: Calibri, sans-serif;" align="center"><span style="font-size: 14pt; line-height: 150%; font-family: verdana, geneva; color: #000000;"><img style="display: block; margin-left: auto; margin-right: auto;" src="https://s3.amazonaws.com/movidesk-files/14C591A7BA42EE3CF2A6443B297D31B5" alt="420x272 s&oacute; logo.jpg" width="227" height="147" />Conceito Inteligente Evolution 7.0.2</span><span style="color: #000000; font-family: verdana, geneva; font-size: 12pt;"><br /><br /></span></div>
<div style="text-align: justify;"><span style="color: #000000; font-family: verdana, geneva; font-size: 12pt;"><strong>Registro de invent&aacute;rio:</strong><br />Ajustes&nbsp;na&nbsp;rotina de registro de invent&aacute;rio para melhorar a performance e o desempenho da rotina&nbsp;<br /><br /><strong>Caixa - Faturamento:</strong><br />Pedido com data de parcelamento vencida causava erro ao faturar no caixa. Para que erro n&atilde;o volte acontecer, foi implementado&nbsp;um alerta no caixa informando que a data do vencimento &eacute; anterior a data atual.&nbsp;<br />O usu&aacute;rio poder&aacute; interagir com o alerta escolhendo se deseja que sistema atualize a data de parcelamento vencida: "Sim" ou "N&atilde;o". <br />Caso a escolha seja "Sim" o sistema ir&aacute; atualizar a data do vencimento da parcela para a data atual e em seguida iniciar o faturamento do pedido. Mas se escolha for "N&atilde;o" o pedido n&atilde;o ser&aacute; faturado.<br /><br /><strong>Pedido de compra:</strong><br />Quando n&atilde;o havia produto informado o sistema retornava erro ao informar forma e prazo de pagamento. Falha corrigida.<br /><br /><strong>Nota fiscal de entrada:</strong><br />Adicionado o novo modelo 66 da (Nota Fiscal de Energia El&eacute;trica Eletr&ocirc;nica &ndash; NF3e) em nota fiscal de entrada. Al&eacute;m da inclus&atilde;o do modelo 66 em nota fiscal de entrada foram realizadas diversas adapta&ccedil;&otilde;es na gera&ccedil;&atilde;o do EFD Fiscal e Contribui&ccedil;&otilde;es.<br /><br /><strong>Relat&oacute;rios padr&atilde;o:</strong><br />Em Alguns casos os Relat&oacute;rios padr&atilde;o estavam apresentando erro "Access Violation" ao rolar a scroll ainda quando o relat&oacute;rio estava processando.<br />O problema foi resolvido alterando tipo de conex&atilde;o do relat&oacute;rio.&nbsp;<br />Implementado a op&ccedil;&atilde;o "abortar", o usu&aacute;rio poder&aacute; abortar o processamento do relat&oacute;rio se assim desejar.<br /></span><span style="font-size: 12pt; line-height: 150%; font-family: verdana, geneva; color: #000000;"><br /><strong>Em caso de d&uacute;vidas, entre em contato com o nosso suporte, estamos &agrave; disposi&ccedil;&atilde;o!</strong><br /><br /><img style="display: block; margin-left: auto; margin-right: auto;" src="https://s3.amazonaws.com/movidesk-files/14C591A7BA42EE3CF2A6443B297D31B5" alt="420x272 s&oacute; logo.jpg" width="227" height="147" /></span></div>
