<div style="line-height: 150%; margin: 0cm 0cm 8pt; font-size: 11pt; font-family: Calibri, sans-serif;" align="center"><span style="font-size: 14pt; line-height: 150%; font-family: verdana, geneva; color: #000000;"><img style="display: block; margin-left: auto; margin-right: auto;" src="https://s3.amazonaws.com/movidesk-files/14C591A7BA42EE3CF2A6443B297D31B5" alt="420x272 s&oacute; logo.jpg" width="227" height="147" />Conceito Inteligente Evolution 7.0.1</span><span style="color: #000000;"><span style="font-size: 14pt; line-height: 150%; font-family: verdana, geneva;"><span style="font-size: 12pt;"><br /></span></span></span><span style="color: #000000; font-family: verdana, geneva; font-size: 12pt;"><br /><br /></span></div>
<div><span style="color: #000000; font-family: verdana, geneva; font-size: 12pt;">Corrigido falha na permiss&atilde;o&nbsp;"Libera Venda ao Cliente que h&aacute; Seis Meses N&atilde;o Compra".<br /><br />A coluna "Estoque" em consulta avan&ccedil;ada do cadastro de produto n&atilde;o estava carregando o estoque geral, corrigido.&nbsp;&nbsp;<br /><br /></span><span style="color: #000000; font-family: verdana, geneva; font-size: 12pt;">Em Consulta Avan&ccedil;ada, o sistema estava travando ao clicar para expandir colunas cujo conte&uacute;do era apresentado por um &ldquo;bal&atilde;o&rdquo;.<br /><br /></span></div>
<div><span style="color: #000000; font-family: verdana, geneva; font-size: 12pt;">De forma intermitente o sistema estava gerando notas com n&uacute;mero em duplicidade, falha corrigida.</span></div>
<div>&nbsp;</div>
<div><span style="color: #000000; font-family: verdana, geneva; font-size: 12pt;">O sistema apresentava uma falha para gerenciar manuten&ccedil;&otilde;es de registros (Salvar or&ccedil;amento, Gerar pedido e faturar caixa...) de forma simult&acirc;nea. Em casos onde dois usu&aacute;rios diferentes editavam um mesmo registro o sistema mostrava&nbsp;erro de Deadlock ao salvar ou aplicar essas altera&ccedil;&otilde;es. Ap&oacute;s o erro, o sistema travava ou em alguns casos o registro ficava inacess&iacute;vel, isso impedindo que usu&aacute;rio finalizasse a opera&ccedil;&atilde;o que havia iniciado. A falha&nbsp;foi corrigida, diversas melhorias de performance foram implementadas.<br /><br />A busca do produto em pedido/or&ccedil;amento n&atilde;o estava aceitando mais de 14 caracteres, devido a isso buscar por descri&ccedil;&atilde;o como (%ANEIS EXT CURVA GEDORE) n&atilde;o era poss&iacute;vel. Falha corrigida.<br /></span><span style="font-size: 12pt; line-height: 150%; font-family: verdana, geneva; color: #000000;"><strong><br />Em caso de d&uacute;vidas, entre em contato com o nosso suporte, estamos &agrave; disposi&ccedil;&atilde;o!</strong><br /><br /><img style="display: block; margin-left: auto; margin-right: auto;" src="https://s3.amazonaws.com/movidesk-files/14C591A7BA42EE3CF2A6443B297D31B5" alt="420x272 s&oacute; logo.jpg" width="227" height="147" /></span></div>
