<div style="position: relative; width: 100%; height: 0; padding-top: 56.2500%; padding-bottom: 0; box-shadow: 0 2px 8px 0 rgba(63,69,81,0.16); margin-top: 1.6em; margin-bottom: 0.9em; overflow: hidden; border-radius: 8px; will-change: transform;"><iframe style="position: absolute; width: 100%; height: 100%; top: 0; left: 0; border: none; padding: 0; margin: 0;" src="https://www.canva.com/design/DAGBRm43FdA/VO7WxAetsGsGxQ1CFWXArw/view?embed" width="300" height="150" allowfullscreen="allowfullscreen">
  </iframe></div>
<div hidden="">Implementa&ccedil;&otilde;es Ordem de produ&ccedil;&atilde;o: Inserido novo m&oacute;dulo; Relat&oacute;rios: Ordem de produ&ccedil;&atilde;o; Sped Fiscal: leiaute bloco K-230 e K-235; Convers&atilde;o de CSTs: Inserido novo rotina Melhorias Pesquisa de registros: Melhorias gerais aplicadas. Legendas: S = Ticket; Q = Issue. Inserido novo m&oacute;dulo S = 32159 Implementado no CIEvolution, a rotina Ordem de produ&ccedil;&atilde;o, esta rotina permitir&aacute; controlar o processo fabril, detalhando especifica&ccedil;&otilde;es e requisitos para a fabrica&ccedil;&atilde;o de um produto espec&iacute;fico. Comumente referida como O.P., essa rotina inclui tanto os produtos acabados quanto os insumos necess&aacute;rios, al&eacute;m de datas de in&iacute;cio e previs&atilde;o de conclus&atilde;o da produ&ccedil;&atilde;o, entre outros detalhes. Ordem de produ&ccedil;&atilde;o Requisitos para dar in&iacute;cio ao processo de produ&ccedil;&atilde;o: &Eacute; preciso cadastrar os insumos necess&aacute;rios para a produ&ccedil;&atilde;o: O cadastro do insumo deve ser realizado na rotina cadastro de produto. Para cadastrar um insumo, siga o processo j&aacute; conhecido de cadastro de produto do tipo mercadoria para revenda, prestando aten&ccedil;&atilde;o em dois detalhes: No cadastro do produto na aba &ldquo;Fiscal&rdquo;, na caixa de listagem "Tipo Item Sped" escolha a op&ccedil;&atilde;o "01 - Mat&eacute;ria prima&rdquo;. Inserido novo m&oacute;dulo Ordem de produ&ccedil;&atilde;o Inserido novo m&oacute;dulo Ordem de produ&ccedil;&atilde;o A partir de um produto classificado como mat&eacute;ria-prima, o sistema apresenta a aba "Local de Estoque Produ&ccedil;&atilde;o". Essa funcionalidade &eacute; essencial para deduzir o saldo de estoque, j&aacute; que, na Ordem de Produ&ccedil;&atilde;o, os insumos ser&atilde;o automaticamente inseridos pelo sistema com base no produto acabado. Ap&oacute;s cadastrar os insumos deve ser cadastrado o produto acabado: O cadastro do produto acabado &eacute; feito atrav&eacute;s da rotina de cadastro de produtos. Para registr&aacute;-lo, o procedimento &eacute; bastante simples, seguindo os mesmos passos utilizados para cadastrar um produto comum de revenda. No entanto, &eacute; crucial atentar para alguns detalhes espec&iacute;ficos que caracterizam um produto como acabado. No cadastro do produto na aba &ldquo;Fiscal&rdquo;, na caixa de listagem "Tipo Item Sped" escolha a op&ccedil;&atilde;o "04 - Produto acabado&rdquo;: Inserido novo m&oacute;dulo Ordem de produ&ccedil;&atilde;o Assim que o produto for categorizado como "04 - Produto acabado" ou como &ldquo;03 -Produto em processo&rdquo;, o sistema apresentar&aacute; uma aba adicional no cadastro do produto, intitulada "Composi&ccedil;&atilde;o do produto". Nessa se&ccedil;&atilde;o, &eacute; necess&aacute;rio incluir os insumos que ser&atilde;o empregados na fabrica&ccedil;&atilde;o do produto acabado. Na defini&ccedil;&atilde;o da composi&ccedil;&atilde;o do produto, &eacute; necess&aacute;rio especificar os insumos e suas respectivas quantidades, bem como os custos de m&atilde;o de obra e outros custos associados ao processo de fabrica&ccedil;&atilde;o. Inserido novo m&oacute;dulo Ordem de produ&ccedil;&atilde;o Inserido novo m&oacute;dulo Ordem de produ&ccedil;&atilde;o Al&eacute;m disso, o sistema fornecer&aacute; a aba "Local de Estoque Produ&ccedil;&atilde;o". O local de estoque precisa ser definido antecipadamente, pois n&atilde;o ser&aacute; solicitado ao adicionar o produto acabado. No entanto, a conclus&atilde;o da O.P aumentar&aacute; o saldo do local de estoque previamente selecionado: Inserido novo m&oacute;dulo Ordem de produ&ccedil;&atilde;o E por fim, ap&oacute;s cadastrar os insumos, &eacute; necess&aacute;rio atualizar o saldo de estoque desses produtos no local escolhido durante o cadastro do produto. Isso pode ser feito por meio de uma nota fiscal de entrada ou por acerto de estoque. Com a conclus&atilde;o dos requisitos mencionados acima, j&aacute; &eacute; poss&iacute;vel iniciar uma Ordem de Produ&ccedil;&atilde;o seguindo os passos descritos. Inserido novo m&oacute;dulo Ordem de produ&ccedil;&atilde;o Lan&ccedil;ar Ordem de Produ&ccedil;&atilde;o: Desenvolvido no menu gest&atilde;o de estoque um item de menu &ldquo;Ordem de produ&ccedil;&atilde;o&rdquo;. Requisitos: O usu&aacute;rio precisa ter as permiss&otilde;es devidamente concedidas em cadastros de usu&aacute;rios: Menu controle de usu&aacute;rios: Controle: Ordem de produ&ccedil;&atilde;o. Ordem de produ&ccedil;&atilde;o Com as permiss&otilde;es concedidas ser&aacute; detalhada o funcionamento da rotina: Clique no bot&atilde;o "+" para come&ccedil;ar o lan&ccedil;amento da O.P. A rotina preencher&aacute; automaticamente alguns campos, como "N&uacute;mero", "Data" e "Hora" de in&iacute;cio e t&eacute;rmino, com base nas etapas. Para salvar &eacute; preciso que ao menos um item acabado seja informado para dar in&iacute;cio ao processo. Os campos de previs&atilde;o de data e hora s&atilde;o opcionais. Ap&oacute;s adicionar um produto insumo e sua quantidade, o sistema automaticamente incluir&aacute; todos os insumos, juntamente com suas respectivas quantidades, com base na quantidade do item insumo especificado. Ap&oacute;s adicionar o insumo, voc&ecirc; pode avan&ccedil;ar para o pr&oacute;ximo passo, que &eacute; iniciar o processo de produ&ccedil;&atilde;o. Para isso, clique no bot&atilde;o "Iniciar Produ&ccedil;&atilde;o". Depois que o produto for fabricado, voc&ecirc; poder&aacute; concluir a Ordem de Produ&ccedil;&atilde;o clicando no bot&atilde;o "Concluir". A Ordem de Produ&ccedil;&atilde;o pode ser cancelada, mas somente antes de ser iniciada. Para cancelar, clique no bot&atilde;o "Op&ccedil;&otilde;es" e em seguida selecione "Cancelar". Ordem de produ&ccedil;&atilde;o. Ordem de produ&ccedil;&atilde;o Aqui est&aacute; um gif demonstrando o funcionamento da rotina: Ordem de produ&ccedil;&atilde;o. Ordem de produ&ccedil;&atilde;o Insumos: Quando a Ordem de Produ&ccedil;&atilde;o for iniciada, o saldo dos insumos ficar&aacute; indispon&iacute;vel e poder&aacute; ser consultado nas pesquisas de produto. A quantidade dos insumos estar&aacute; dispon&iacute;vel no campo correspondente. Ao concluir a Ordem de Produ&ccedil;&atilde;o, ser&aacute; realizada a baixa no saldo de estoque. Impactos causados no saldo de estoque: Ordem de produ&ccedil;&atilde;o. Ordem de produ&ccedil;&atilde;o Produto acabado: Ao iniciar a Ordem de Produ&ccedil;&atilde;o, o saldo do Produto acabado ficar&aacute; "Em produ&ccedil;&atilde;o", por&eacute;m n&atilde;o estar&aacute; dispon&iacute;vel para movimenta&ccedil;&otilde;es. No entanto, ser&aacute; poss&iacute;vel validar a quantidade "Em produ&ccedil;&atilde;o" atrav&eacute;s das pesquisas padr&atilde;o do produto. Ap&oacute;s a conclus&atilde;o da Ordem de Produ&ccedil;&atilde;o, ser&aacute; efetuada a entrada no saldo de estoque do Produto acabado. Ordem de produ&ccedil;&atilde;o. Ordem de produ&ccedil;&atilde;o Os impactos gerados pela Ordem de Produ&ccedil;&atilde;o na gera&ccedil;&atilde;o do SPED Fiscal: Para as empresas que produzem produtos acabados e est&atilde;o sujeitas &agrave; gera&ccedil;&atilde;o do Sped Fiscal, h&aacute; a obrigatoriedade, baseada no faturamento, de gerar o Bloco-K com leiaute completa. Com a implementa&ccedil;&atilde;o da rotina de Ordem de Produ&ccedil;&atilde;o no sistema, agora ele est&aacute; apto a gerar o Sped Fiscal, abrangendo os blocos K01, K10, K100, K200, K230, K235 e K990 Q = 1588, Relat&oacute;rios Ordem de Produ&ccedil;&atilde;o. Com a implementa&ccedil;&atilde;o da nova rotina O.P., foram adicionados dois novos relat&oacute;rios. 01-Ordem Produ&ccedil;&atilde;o (Geral) 02-Ordem Produ&ccedil;&atilde;o (Por status) leiaute bloco K Sped Fiscal Q = 1570, Em vers&otilde;es Anteriores, o arquivo do Sped fiscal era gerado automaticamente com o leiaute simplificado do bloco K-010. Contudo, com a implementa&ccedil;&atilde;o da rotina de Ordem de Produ&ccedil;&atilde;o, surgiu a necessidade de pr&eacute;-definir o leiaute do bloco K como simplificado, restrito aos saldos de estoque ou de forma completa. leiaute bloco K Sped Fiscal Para atender a essa necessidade, foi adicionada uma op&ccedil;&atilde;o na aba de par&acirc;metros do EFD em par&acirc;metros gerais, onde agora &eacute; poss&iacute;vel selecionar o leiaute desejado para o bloco K-010. Dessa forma, o arquivo do EFD ser&aacute; gerado de acordo com a op&ccedil;&atilde;o escolhida. leiaute bloco K Sped Fiscal Perfil EFD fiscal: Na aba de par&acirc;metros do EFD, dentro dos par&acirc;metros gerais, incluiu uma caixa de listagem que apresente os diferentes perfis dispon&iacute;veis para gera&ccedil;&atilde;o do SPED Fiscal. Isso possibilitar&aacute; a defini&ccedil;&atilde;o de um perfil padr&atilde;o conforme necess&aacute;rio. EFD Fiscal bloco k-200 Sped Fiscal Q = 1667 Na aba de par&acirc;metros do EFD, dentro de par&acirc;metros gerais, foi adicionada uma caixa de listagem "Gerar K-200 Completo" com op&ccedil;&otilde;es &ldquo;Sim/N&atilde;o&rdquo;. O bloco K-200 ser&aacute; gerado conforme a op&ccedil;&atilde;o selecionada. Implementa&ccedil;&atilde;o nova rotina Q = 1517 No processo de devolu&ccedil;&atilde;o, o sistema pode carregar automaticamente o CFOP de devolu&ccedil;&atilde;o, mas isso s&oacute; &eacute; poss&iacute;vel quando h&aacute; um CFOP associado no formul&aacute;rio de cadastro da tabela CFOP. No entanto, durante o processo de devolu&ccedil;&atilde;o, tamb&eacute;m &eacute; preciso fornecer os CSTs de Pis, Cofins e IPI. Para simplificar esse procedimento e reduzir erros de lan&ccedil;amento, foi desenvolvido um m&oacute;dulo de cadastro de convers&atilde;o de CSTs. Convers&atilde;o de CSTs Implementa&ccedil;&atilde;o nova rotina No m&oacute;dulo, &eacute; poss&iacute;vel associar o CST de origem e destino da seguinte forma: Associar o CST de PIS de origem para convert&ecirc;-lo em CST de PIS de destino. Associar o CST de COFINS de origem para convert&ecirc;-lo em CST de COFINS de destino. Associar o CST de IPI de origem para convert&ecirc;-lo em CST de IPI de destino Convers&atilde;o de CSTs Implementa&ccedil;&atilde;o nova rotina Passos para realizar a associa&ccedil;&atilde;o: 1 - Clique sobre o campo &ldquo;Convers&atilde;o CST&rdquo;: Convers&atilde;o de CSTs Ap&oacute;s o cadastro das convers&otilde;es de CSTs, &eacute; necess&aacute;rio associ&aacute;-las &agrave; tabela de CFOP. Esta associa&ccedil;&atilde;o &eacute; realizada no campo "Convers&atilde;o CST" dispon&iacute;vel no cadastro do CFOP no painel de associa&ccedil;&otilde;es. 2 - Escolha uma das convers&otilde;es cadastradas: Implementa&ccedil;&atilde;o nova rotina 3 - Ap&oacute;s selecionar a convers&atilde;o de CST desejada, ela ser&aacute; automaticamente associada aos CFOP correspondentes. Implementa&ccedil;&atilde;o nova rotina Regras sobre o processo de associa&ccedil;&atilde;o entre CFOP e Convers&atilde;o de CST: Durante o processo de devolu&ccedil;&atilde;o, o sistema automaticamente incluir&aacute; os CSTs de PIS, COFINS e IPI quando o CFOP utilizado estiver vinculado a um registro de Convers&atilde;o de CSTs. Al&eacute;m dessa associa&ccedil;&atilde;o entre o CFOP e a Convers&atilde;o de CSTs, o sistema tamb&eacute;m verificar&aacute;, item por item, se eles possuem os CSTs de origem de PIS, COFINS e IPI. Caso essa condi&ccedil;&atilde;o seja atendida, os CSTs de destino ser&atilde;o replicados nos itens correspondentes, levando em considera&ccedil;&atilde;o as quantidades devolvidas. Convers&atilde;o de CSTs Implementa&ccedil;&atilde;o nova rotina Regras sobre o processo de associa&ccedil;&atilde;o entre CFOP e Convers&atilde;o de CST: Durante o processo de devolu&ccedil;&atilde;o, o sistema automaticamente incluir&aacute; os CSTs de PIS, COFINS e IPI quando o CFOP utilizado estiver vinculado a um registro de Convers&atilde;o de CSTs. Al&eacute;m dessa associa&ccedil;&atilde;o entre o CFOP e a Convers&atilde;o de CSTs, o sistema tamb&eacute;m verificar&aacute;, item por item, se eles possuem os CSTs de origem de PIS, COFINS e IPI. Caso essa condi&ccedil;&atilde;o seja atendida, os CSTs de destino ser&atilde;o replicados nos itens correspondentes, levando em considera&ccedil;&atilde;o as quantidades devolvidas. Convers&atilde;o de CSTs Melhorias gerais aplicadas Pesquisa de registros Q = 1589, Foram feitas algumas melhorias na Pesquisa de registros padr&atilde;o (Ctrl + P), dentre elas: Novo aspecto visual implementado na fun&ccedil;&atilde;o: Remo&ccedil;&atilde;o da aba &ldquo;Configurar&rdquo; e adi&ccedil;&atilde;o do bot&atilde;o , o qual permite a cria&ccedil;&atilde;o de um novo filtro de pesquisa: Remo&ccedil;&atilde;o do bot&atilde;o &ldquo;Apagar&rdquo; e inser&ccedil;&atilde;o do bot&atilde;o , o qual far&aacute; a exclus&atilde;o do filtro selecionado: Obs.: Filtros padr&otilde;es n&atilde;o podem ser removidos. Implementada uma valida&ccedil;&atilde;o no momento de excluir um filtro de pesquisa: Valida&ccedil;&otilde;es inseridas no uso da tecla &ldquo;ESC&rdquo;: Voltar para a filtragem quando estiver na tela de cria&ccedil;&atilde;o de um filtro; Quando estiver em procura, e o foco n&atilde;o for o campo de op&ccedil;&otilde;es de filtros, voltar o foco para o campo de op&ccedil;&otilde;es de filtros. Quando estiver com o foco no campo de pesquisa, fechar a tela.</div>
