<div style="position: relative; width: 100%; height: 0; padding-top: 56.2500%; padding-bottom: 0; box-shadow: 0 2px 8px 0 rgba(63,69,81,0.16); margin-top: 1.6em; margin-bottom: 0.9em; overflow: hidden; border-radius: 8px; will-change: transform;">
	<iframe height="150" width="300" src="https://www.canva.com/design/DAF4REPl6VM/view?embed" style="position: absolute; width: 100%; height: 100%; top: 0; left: 0; border: none; padding: 0; margin: 0;"> </iframe>
</div>
<div hidden="">Conceito Inteligente Evolution 7.2.4 Implementa&ccedil;&otilde;es Defini&ccedil;&otilde;es de Usu&aacute;rios: Novo modo de notifica&ccedil;&atilde;o para as centrais de documentos; Pedidos/Or&ccedil;amentos: Campo n&uacute;mero de endere&ccedil;o na aba &quot;Endere&ccedil;o Entrega&quot;; Par&acirc;metros Gerais: Possibilidade de selecionar a vers&atilde;o do documento fiscal. Melhorias Pesquisa de produtos (F11): Ajuste para pesquisar produtos por c&oacute;digos de barras EAN-8 e UCC-12; Caixa: Mudan&ccedil;as na tela &quot;Transa&ccedil;&otilde;es de cart&otilde;es&quot;; Menu Principal:&nbsp;Pesquisa&nbsp;agora mant&eacute;m o filtro&nbsp;quando trocada a filial; Parceiros: Melhorias nas valida&ccedil;&otilde;es de cadastro. Corre&ccedil;&otilde;es Pedidos/or&ccedil;amentos: Falha na&nbsp;exibi&ccedil;&atilde;o do n&uacute;mero de&nbsp;endere&ccedil;o adicional; Nota Fiscal de Entrada: Erro ao importar XML de nota fiscal com itens com lote; Tributa&ccedil;&atilde;o por UF: Valida&ccedil;&atilde;o incorreta na substitui&ccedil;&atilde;o de um CFOP com finalidade &quot;Vendas&quot;; S = Ticket Q = Issue Implementa&ccedil;&otilde;es Q&nbsp;=&nbsp;1449 O CIEvolution possui uma forma de notificar aos usu&aacute;rios quando h&aacute; documentos eletr&ocirc;nicos com algum tipo de problema, essa forma se d&aacute; atrav&eacute;s dos bal&otilde;es que surgem ao canto inferior direito da tela: Para que o usu&aacute;rio veja essas notifica&ccedil;&otilde;es &eacute; necess&aacute;rio que ele esteja vinculado a um &quot;Perfil&quot;&nbsp;definido para receber as notifica&ccedil;&otilde;es. Foi implementada uma nova funcionalidade que permite aos usu&aacute;rios fora do &quot;Perfil&quot; de notifica&ccedil;&atilde;o, verem as notifica&ccedil;&otilde;es fiscais. Para ativar a funcionalidade acesse o m&oacute;dulo &quot;Defini&ccedil;&otilde;es de Usu&aacute;rios&quot;, escolha o usu&aacute;rio e marque o checkbox &quot;Fiscal&quot; dentro da se&ccedil;&atilde;o &quot;Notifica&ccedil;&otilde;es&quot;: Q&nbsp;=&nbsp;1456 Foi implementado o campo &quot;N&uacute;mero&quot; do endere&ccedil;o do parceiro na aba &quot;Endere&ccedil;o Entrega&quot; em &quot;Pedidos/Or&ccedil;amentos&quot;: Q&nbsp;=&nbsp;1448 Anteriormente as vers&otilde;es dos documentos fiscais&nbsp;emitidos eram definidas internamente no CIDOC-e. No m&oacute;dulo &quot;Par&acirc;metros Gerais&quot;, aba &quot;Doc. Eletr&ocirc;nicos&quot;, foram implementados os campos que permitem definir a vers&atilde;o do documento fiscal a ser utilizada pelo CIDOC-e: Obs.: O layout da aba &quot;Doc. Eletr&ocirc;nicos&quot; foi atualizado junto com a implementa&ccedil;&atilde;o dos novos campos: Melhorias S = 31633 Foi feito um ajuste para a busca de produtos (F11) conseguir localizar produtos&nbsp;atrav&eacute;s dos&nbsp;c&oacute;digos de barras com o padr&atilde;o UCC-12 (exemplo:&nbsp;602883015982) e EAN/UCC-8 (exemplo:&nbsp;42360407). Q = 1446 A tela &quot;Transa&ccedil;&otilde;es de cart&otilde;es&quot; sofreu alguns ajustes gerais: Quando for clicado no bot&atilde;o &ldquo;Lan&ccedil;ar&rdquo; (aba &ldquo;POS&rdquo; ou &ldquo;TEF&rdquo;) sem ter selecionado um equipamento, logo, vai aparecer uma mensagem impedindo o lan&ccedil;amento: Os nomes das primeiras colunas da tela de sele&ccedil;&atilde;o de equipamentos eram os nomes dos respectivos campos no banco de dados. Foram atualizados os nomes para &ldquo;Id. Equipamento&rdquo; e &ldquo;Id. Administradora&rdquo;: Adicionado o atalho &ldquo;F8&rdquo; para abrir a&nbsp;tela de equipamentos cadastrados: Q =&nbsp;1453 Quando for feita a filtragem de um m&oacute;dulo na pesquisa do Menu Principal e for trocada a filial, logo, o filtro ir&aacute; se manter. Q =&nbsp;1440 Houve melhorias em algumas valida&ccedil;&otilde;es no&nbsp;m&oacute;dulo &quot;Parceiros&quot; (Cadastro): A depender do tipo fiscal (CPF ou CNPJ) selecionado, o CIEvolution ir&aacute; validar se faltar caracteres no campo e houver uma tentativa de gravar o registro; Agora a valida&ccedil;&atilde;o de telefone tamb&eacute;m vale para os campos &ldquo;Telefone gr&aacute;tis&rdquo;, &ldquo;Fax&rdquo; e &ldquo;Celular&rdquo;; Quando faltar preencher o E-mail no cadastro do parceiro, a mensagem informar&aacute; o local do campo: &ldquo;Adicionais &ndash; Informar o E-mail&rdquo;: Corre&ccedil;&otilde;es Q =&nbsp;1443 Em uma venda no m&oacute;dulo de Pedidos/Or&ccedil;amentos, caso o parceiro possua um endere&ccedil;o adicional no seu cadastro, &eacute; poss&iacute;vel inserir esse endere&ccedil;o adicional nos campos de endere&ccedil;o de faturamento da venda. Quando um endere&ccedil;o adicional era inserido como endere&ccedil;o de faturamento, o&nbsp;campo de&nbsp;&quot;N&uacute;mero&quot; de endere&ccedil;o do parceiro estava carregando o do endere&ccedil;o principal, n&atilde;o o n&uacute;mero do endere&ccedil;o adicional. S = 31624 No m&oacute;dulo &quot;Notas Fiscais de Entrada&quot; ocorria um erro ao tentar importar um XML se&nbsp;houvesse mais de um lote por produto, impedindo a continuidade da importa&ccedil;&atilde;o. Q = 1424 Em &quot;Tributa&ccedil;&atilde;o por UF&quot; h&aacute; uma valida&ccedil;&atilde;o que n&atilde;o permite inserir mais de um dado fiscal cujo CFOP &eacute; de finalidade &quot;Vendas&quot;, a mensagem que aparece &eacute; a seguinte: &quot;N&atilde;o &eacute; permitido incluir mais de um CFOP com finalidade venda!&quot;. Essa valida&ccedil;&atilde;o ocorria incorretamente quando j&aacute; tinha&nbsp;um dado fiscal cadastrado na UF, e fosse feita a substitui&ccedil;&atilde;o desse CFOP por outro tamb&eacute;m com finalidade venda. Obs.: Nos casos em que houver dados fiscais com CFOP de venda de produtos e presta&ccedil;&atilde;o de servi&ccedil;os (Tamb&eacute;m tem finalidade &quot;Vendas&quot;) na mesma UF, a valida&ccedil;&atilde;o ocorrer&aacute; caso haja a tentativa de substituir o CFOP por outro de mesma finalidade. Informa&ccedil;&otilde;es para o Suporte: Q =&nbsp;1451 Foi adicionado&nbsp;o campo &quot;ACE_ID&quot; na tabela &quot;PAGAMENTOS_ITENS&quot; que &eacute; respons&aacute;vel por armazenar o c&oacute;digo do equipamento utilizado nas vendas feitas no CIMobile e no PDV. Q =&nbsp;1457 No CIMobile, a op&ccedil;&atilde;o &quot;Extrato&quot; (Parceiros) detalha o credi&aacute;rio do parceiro de forma anal&iacute;tica, permitindo ver os t&iacute;tulos em abertos, dentre outras coisas. Os t&iacute;tulos mostrados no extrato estavam trazendo o valor total nominal, sendo que o correto seria o valor total do saldo devedor, pois h&aacute; possibilidade de haver juros e multa acrescidos ao valor nominal. Essa vers&atilde;o do CIEvolution teve a procedure respons&aacute;vel por esse c&aacute;lculo atualizada, tornando obrigat&oacute;ria a atualiza&ccedil;&atilde;o do CIEvolution para utilizar o CIMobile corretamente.</div>
