<div style="position: relative; width: 100%; height: 0; padding-top: 56.2500%; padding-bottom: 0; box-shadow: 0 2px 8px 0 rgba(63,69,81,0.16); margin-top: 1.6em; margin-bottom: 0.9em; overflow: hidden; border-radius: 8px; will-change: transform;"><iframe style="position: absolute; width: 100%; height: 100%; top: 0; left: 0; border: none; padding: 0; margin: 0;" src="https://www.canva.com/design/DAGB2pcem9I/2Py8BoP69QqlwOUvYPcrVA/view?embed" width="300" height="150"> </iframe></div>
<div hidden="">Cota&ccedil;&atilde;o: Nova rotina; Cadastro de produto: Implementado tipo fiscal do cadastro produto por empresa; Ordem de produ&ccedil;&atilde;o: Novas valida&ccedil;&otilde;es e permiss&otilde;es de saldo de estoque; Central DOC-e: Aprimorada a performance da filtragem de documentos. Cadastro de Produtos: M&uacute;ltiplas Refer&ecirc;ncias; Cadastro de Produtos: Ajuste na aba &ldquo;Movimenta&ccedil;&atilde;o&rdquo;; Ordem de Produ&ccedil;&atilde;o: Atualiza&ccedil;&atilde;o do custo de aquisi&ccedil;&atilde;o do "Produto acabado" ao finalizar O.P.; Ordem de produ&ccedil;&atilde;o: Adicionar estoque atual na tela de inclus&atilde;o de produto; Cadastro de produto: Valida&ccedil;&atilde;o do SKU; Cadastro de produto: C&oacute;digo de barras padr&atilde;o etiqueta, vazio; Ordem de Produ&ccedil;&atilde;o : Bug ao tentar excluir produtos a serem produzidos; Pedido/Or&ccedil;amento: Erro ao incluir item no or&ccedil;amento; F11: Falha na consulta; Pedido de compra: Aba ultimas compras na tela de pesquisa; Cadastro de Produto: Conflito na valida&ccedil;&atilde;o do c&oacute;digo de barras; Q = 1459 Atualmente no Evolution, o m&oacute;dulo de Pedido de Compra, &eacute; utilizado para criar &ldquo;Or&ccedil;amentos&rdquo; os quais podem ou n&atilde;o ser gerados como pedido. Pensando em disponibilizar ao usu&aacute;rio uma maior capacidade de tratar cota&ccedil;&otilde;es para determinar a melhor compra de acordo aos itens e aos fornecedores, foi implementada a rotina de Cota&ccedil;&atilde;o. A proposta da nova rotina &eacute; garantir ao usu&aacute;rio que a partir dos dados preenchidos como a rela&ccedil;&atilde;o de produtos e rela&ccedil;&atilde;o de fornecedores, o mesmo tenha informa&ccedil;&otilde;es e ferramentas suficientes para tomar a melhor decis&atilde;o de compra. Isso ocorre da seguinte forma: A Cota&ccedil;&atilde;o &eacute; composta de 3 M&oacute;dulos. O M&oacute;dulo "Lista Cota&ccedil;&atilde;o" &eacute; respons&aacute;vel por dar in&iacute;cio a cota&ccedil;&atilde;o, onde ser&atilde;o coletados quais condi&ccedil;&otilde;es s&atilde;o esperadas pelo cliente, para qual rela&ccedil;&atilde;o de produtos em determinados fornecedores. O m&oacute;dulo disp&otilde;e da impress&atilde;o dessa rela&ccedil;&atilde;o para cada Fornecedor da lista de forma individual, a fim de ser enviado ao mesmo, para que seja obtida uma resposta de quais produtos s&atilde;o atendidos a que valor e a qual quantidade, al&eacute;m das condi&ccedil;&otilde;es de Prazo de Entrega, Frete e Pagamento. Quando for necess&aacute;rio ter acesso individualmente a cota&ccedil;&atilde;o de cada fornecedor por Lista de Cota&ccedil;&atilde;o, deve dirigir-se ao M&oacute;dulo "Cota&ccedil;&atilde;o", onde &eacute; poss&iacute;vel filtrar e conferir os dados preenchidos ou n&atilde;o de cada rela&ccedil;&atilde;o de produtos por cada fornecedor: Ao receber o retorno do fornecedor sobre a rela&ccedil;&atilde;o de itens enviada, deve-se dirigir ao M&oacute;dulo "An&aacute;lise Cota&ccedil;&atilde;o", onde as informa&ccedil;&otilde;es de retorno podem ser inseridas por fornecedor de acordo a Lista De Cota&ccedil;&atilde;o selecionada. Ap&oacute;s preencher o retorno dos fornecedores, o sistema utilizar&aacute; da ordena&ccedil;&atilde;o de crit&eacute;rios feita pelo usu&aacute;rio, para determinar de acordo a ordem dos crit&eacute;rios definidos, qual fornecedor atende em geral as melhores condi&ccedil;&otilde;es. Dessa forma, &eacute; exibido um Ranking sugerindo o melhor fornecedor, sendo poss&iacute;vel optar pelo ganhador ou por outro. Como cadastrar um Comprador: Para cadastrar um comprador, &eacute; necess&aacute;rio que o tenha cadastrado anteriormente como Parceiro em Cadastro &gt; Parceiros. Ap&oacute;s isso, basta procurar na Busca R&aacute;pida (Ctrl + F) por &ldquo;Compradores&rdquo;: Requisitos para realizar uma Cota&ccedil;&atilde;o Para realizar uma cota&ccedil;&atilde;o &eacute; preciso que tenha cadastrado em sua base, pelo menos um Comprador. No m&oacute;dulo de Cadastro de Compradores, deve-se inserir o parceiro desejado e salvar o registro: A Cota&ccedil;&atilde;o passa por duas etapas principais, sendo a primeira, a cria&ccedil;&atilde;o da Lista de Cota&ccedil;&atilde;o, onde se informa as condi&ccedil;&otilde;es de entrega e pagamento prefer&iacute;veis, quais fornecedores participam da cota&ccedil;&atilde;o, itens solicitados com suas respectivas quantidades e valores de imposto. Lista de Cota&ccedil;&atilde;o Dados necess&aacute;rios: Comprador; Tipo pagamento (Prefer&ecirc;ncia); Tipo entrada; Tipo pedido; Tipo frete; Melhor dia de entrega; Per&iacute;odo Vigente; Rela&ccedil;&atilde;o de Fornecedores; Rela&ccedil;&atilde;o de Produtos; Gerar Cota&ccedil;&atilde;o para an&aacute;lise; Para dar in&iacute;cio a uma nova cota&ccedil;&atilde;o, deve-se primeiro criar a Lista de Cota&ccedil;&atilde;o, a qual consiste dos dados apresentados acima (Prazos, Fornecedores e Produtos). Em Gest&atilde;o de Estoque &gt; Compras &gt; Lista Cota&ccedil;&atilde;o: Os campos do cabe&ccedil;alho s&atilde;o obrigat&oacute;rios para prosseguir. Campos como: Comprador Tipo pagamento Frete Data Data inicial Data final Ser&atilde;o informados novamente em &ldquo;An&aacute;lise de Cota&ccedil;&atilde;o&rdquo;. Campos do cabe&ccedil;alho (Para fins de relat&oacute;rio) Tipo Entrada Entrada Normal Entrada Imobilizada Entrada Consignada Tipo Pedido De Emerg&ecirc;ncia Especulativa Antecipada Contratada Reposi&ccedil;&atilde;o 0 - Digitado: Ainda n&atilde;o n&atilde;o foi Gerado 1 - Gerado: Foi Gerado e est&aacute; dispon&iacute;vel em An&aacute;lise de Cota&ccedil;&atilde;o 2 - Encerrado: J&aacute; foi gerado o pedido de compra O &ldquo;Melhor dia de Entrega&rdquo; &eacute; utilizado para avaliar o prazo de entrega dos fornecedores. O &ldquo;Per&iacute;odo Vigente&rdquo; &eacute; o per&iacute;odo em que essa cota&ccedil;&atilde;o estar&aacute; v&aacute;lida. Ap&oacute;s a data final, n&atilde;o ser&aacute; poss&iacute;vel gerar a Lista. Assim como o grid Fornecedores em &ldquo;Fornecedores Participantes&rdquo;: Al&eacute;m desses dados, &eacute; necess&aacute;rio inserir a rela&ccedil;&atilde;o dos produtos com suas respectivas quantidades necess&aacute;rias no grid Produtos. Isso pode ser feito da forma comum atrav&eacute;s do grid ou a partir da ferramenta pr&aacute;tica de adi&ccedil;&atilde;o de produtos. Inserir atrav&eacute;s do bot&atilde;o &ldquo;+ Adicionar&rdquo;: A impress&atilde;o da Lista de Cota&ccedil;&atilde;o ser&aacute; exibida no seguinte modelo: Conceito Inteligente Evolution 7.2.9 Implementa&ccedil;&otilde;es Cota&ccedil;&atilde;o: Nova rotina; Cadastro de produto: Implementado tipo fiscal do cadastro produto por empresa; Ordem de produ&ccedil;&atilde;o: Novas valida&ccedil;&otilde;es e permiss&otilde;es de saldo de estoque; Melhorias Central DOC-e: Aprimorada a performance da filtragem de documentos. Cadastro de Produtos: M&uacute;ltiplas Refer&ecirc;ncias; Cadastro de Produtos: Ajuste na aba &ldquo;Movimenta&ccedil;&atilde;o&rdquo;; Ordem de Produ&ccedil;&atilde;o: Atualiza&ccedil;&atilde;o do custo de aquisi&ccedil;&atilde;o do "Produto acabado" ao finalizar O.P.; Ordem de produ&ccedil;&atilde;o: Adicionar estoque atual na tela de inclus&atilde;o de produto; Corre&ccedil;&otilde;es Cadastro de produto: Valida&ccedil;&atilde;o do SKU; Cadastro de produto: C&oacute;digo de barras padr&atilde;o etiqueta, vazio; Ordem de Produ&ccedil;&atilde;o : Bug ao tentar excluir produtos a serem produzidos; Pedido/Or&ccedil;amento: Erro ao incluir item no or&ccedil;amento; F11: Falha na consulta; Pedido de compra: Aba ultimas compras na tela de pesquisa; Cadastro de Produto: Conflito na valida&ccedil;&atilde;o do c&oacute;digo de barras; S = Ticket Q = Issue Implementa&ccedil;&otilde;es Q = 1459 Atualmente no Evolution, o m&oacute;dulo de Pedido de Compra, &eacute; utilizado para criar &ldquo;Or&ccedil;amentos&rdquo; os quais podem ou n&atilde;o ser gerados como pedido. Pensando em disponibilizar ao usu&aacute;rio uma maior capacidade de tratar cota&ccedil;&otilde;es para determinar a melhor compra de acordo aos itens e aos fornecedores, foi implementada a rotina de Cota&ccedil;&atilde;o. A proposta da nova rotina &eacute; garantir ao usu&aacute;rio que a partir dos dados preenchidos como a rela&ccedil;&atilde;o de produtos e rela&ccedil;&atilde;o de fornecedores, o mesmo tenha informa&ccedil;&otilde;es e ferramentas suficientes para tomar a melhor decis&atilde;o de compra. Isso ocorre da seguinte forma: A Cota&ccedil;&atilde;o &eacute; composta de 3 M&oacute;dulos. O M&oacute;dulo "Lista Cota&ccedil;&atilde;o" &eacute; respons&aacute;vel por dar in&iacute;cio a cota&ccedil;&atilde;o, onde ser&atilde;o coletados quais condi&ccedil;&otilde;es s&atilde;o esperadas pelo cliente, para qual rela&ccedil;&atilde;o de produtos em determinados fornecedores. O m&oacute;dulo disp&otilde;e da impress&atilde;o dessa rela&ccedil;&atilde;o para cada Fornecedor da lista de forma individual, a fim de ser enviado ao mesmo, para que seja obtida uma resposta de quais produtos s&atilde;o atendidos a que valor e a qual quantidade, al&eacute;m das condi&ccedil;&otilde;es de Prazo de Entrega, Frete e Pagamento. Ao receber o retorno do fornecedor sobre a rela&ccedil;&atilde;o de itens enviada, deve-se dirigir ao M&oacute;dulo "An&aacute;lise Cota&ccedil;&atilde;o", onde as informa&ccedil;&otilde;es de retorno podem ser inseridas por fornecedor de acordo a Lista De Cota&ccedil;&atilde;o selecionada. Ap&oacute;s preencher o retorno dos fornecedores, o sistema utilizar&aacute; da ordena&ccedil;&atilde;o de crit&eacute;rios feita pelo usu&aacute;rio, para determinar de acordo a ordem dos crit&eacute;rios definidos, qual fornecedor atende em geral as melhores condi&ccedil;&otilde;es. Dessa forma, &eacute; exibido um Ranking sugerindo o melhor fornecedor, sendo poss&iacute;vel optar pelo ganhador ou por outro. Quando for necess&aacute;rio ter acesso individualmente a cota&ccedil;&atilde;o de cada fornecedor por Lista de Cota&ccedil;&atilde;o, deve dirigir-se ao M&oacute;dulo "Cota&ccedil;&atilde;o", onde &eacute; poss&iacute;vel filtrar e conferir os dados preenchidos ou n&atilde;o de cada rela&ccedil;&atilde;o de produtos por cada fornecedor: Requisitos para realizar uma Cota&ccedil;&atilde;o: Para realizar uma cota&ccedil;&atilde;o &eacute; preciso que tenha cadastrado em sua base, pelo menos um Comprador. Como cadastrar um Comprador: Para cadastrar um comprador, &eacute; necess&aacute;rio que o tenha cadastrado anteriormente como Parceiro em Cadastro &gt; Parceiros. Ap&oacute;s isso, basta procurar na Busca R&aacute;pida (Ctrl + F) por &ldquo;Compradores&rdquo;: No m&oacute;dulo de Cadastro de Compradores, deve-se inserir o parceiro desejado e salvar o registro: A Cota&ccedil;&atilde;o passa por duas etapas principais, sendo a primeira delas a Lista de Cota&ccedil;&atilde;o, onde se informa as condi&ccedil;&otilde;es de entrega e pagamento prefer&iacute;veis, quais fornecedores participam da cota&ccedil;&atilde;o, itens solicitados com suas respectivas quantidades e valores de imposto. Dados necess&aacute;rios: Comprador; Tipo pagamento (Prefer&ecirc;ncia); Tipo entrada; Tipo pedido; Tipo frete; Melhor dia de entrega; Per&iacute;odo Vigente; Rela&ccedil;&atilde;o de Fornecedores; Rela&ccedil;&atilde;o de Produtos; Gerar Cota&ccedil;&atilde;o para an&aacute;lise; Como iniciar uma cota&ccedil;&atilde;o: Para dar in&iacute;cio a uma nova cota&ccedil;&atilde;o, deve-se primeiro criar a Lista de Cota&ccedil;&atilde;o, a qual consiste dos dados apresentados acima (Prazos, Fornecedores e Produtos). Adicionar uma nova Lista de Cota&ccedil;&atilde;o em Gest&atilde;o de Estoque &gt; Compras &gt; Lista Cota&ccedil;&atilde;o: Campos do cabe&ccedil;alho (Para fins de relat&oacute;rio) Tipo Entrada Entrada Normal Entrada Imobilizada Entrada Consignada Tipo Pedido De Emerg&ecirc;ncia Especulativa Antecipada Contratada Reposi&ccedil;&atilde;o Os dados do cabe&ccedil;alho devem ser preenchidos de acordo a cota&ccedil;&atilde;o que est&aacute; sendo realizada: [.] Melhor dia de entrega: O &ldquo;Melhor dia de Entrega&rdquo; &eacute; utilizado para avaliar o prazo de entrega dos fornecedores. [.] Per&iacute;odo Vigente: O &ldquo;Per&iacute;odo Vigente&rdquo; &eacute; o per&iacute;odo em que essa cota&ccedil;&atilde;o estar&aacute; v&aacute;lida. Ap&oacute;s a data final, n&atilde;o ser&aacute; poss&iacute;vel gerar a Lista. [.] Status: 0 - Digitado, N&atilde;o foi gerado ainda. 1 - Gerado, Foi gerado e est&aacute; dispon&iacute;vel em "An&aacute;lise Cota&ccedil;&atilde;o". 2 - Encerrado, J&aacute; foi gerado um pedido referente a lista de cota&ccedil;&atilde;o. Inserir Fornecedores em &ldquo;Fornecedores Participantes&rdquo;: Al&eacute;m desses dados, &eacute; necess&aacute;rio inserir a rela&ccedil;&atilde;o dos produtos com suas respectivas quantidades necess&aacute;rias no grid Produtos. Isso pode ser feito da forma comum atrav&eacute;s do grid ou a partir da ferramenta pr&aacute;tica de adi&ccedil;&atilde;o de produtos. Inserir atrav&eacute;s do bot&atilde;o &ldquo;+ Adicionar&rdquo;: Obs.: O atalho para o uso da ferramenta se encontra na tecla F4. Inserir atrav&eacute;s da inser&ccedil;&atilde;o padr&atilde;o pelo grid: Ap&oacute;s preencher os dados necess&aacute;rios, &eacute; preciso Gerar a Cota&ccedil;&atilde;o para prosseguir para a An&aacute;lise. Isso &eacute; feito clicando sobre o bot&atilde;o &ldquo;Gerar Cota&ccedil;&atilde;o&rdquo;: OBS.: Caso queira criar a lista por&eacute;m devido a alguma emin&ecirc;ncia de adicionar, modificar ou excluir determinado dado, n&atilde;o queira gerar mas apenas salvar, &eacute; poss&iacute;vel. Quando necess&aacute;rio, caso a Lista n&atilde;o tenha sido gerada pode-se retornar ao registro e editar de acordo a sua prefer&ecirc;ncia. Ap&oacute;s Gerado o registro da Lista De Cota&ccedil;&atilde;o, n&atilde;o &eacute; poss&iacute;vel mais alter&aacute;-lo. Para imprimir a lista de cota&ccedil;&atilde;o, informando os Fornecedores e a rela&ccedil;&atilde;o de itens, &eacute; preciso clicar no bot&atilde;o de impress&atilde;o do M&oacute;dulo "Lista de Cota&ccedil;&atilde;o": A impress&atilde;o da Lista de Cota&ccedil;&atilde;o ser&aacute; exibida no seguinte modelo: Ao gerar determinada Lista, o Grid fornecedores disponibilizar&aacute; o uso da coluna de impress&atilde;o de rela&ccedil;&atilde;o de itens por fornecedor: Antes de gerar a lista: Depois de gerar a lista: A impress&atilde;o do Grid Fornecedores foi implementada com o objetivo de prover ao respons&aacute;vel pela cota&ccedil;&atilde;o, uma rela&ccedil;&atilde;o para cada fornecedor. Ou seja, cada vez que for necess&aacute;rio enviar a lista da cota&ccedil;&atilde;o para determinado fornecedor, ser&aacute; preciso clicar na impress&atilde;o daquele fornecedor. Logo o sistema ir&aacute; trazer uma lista no seguinte modelo: A partir do momento em que a Lista de Cota&ccedil;&atilde;o foi gerada, deve-se dar segmento por meio do M&oacute;dulo "An&aacute;lise Cota&ccedil;&atilde;o". As cota&ccedil;&otilde;es Geradas s&atilde;o exibidas no m&oacute;dulo An&aacute;lise Cota&ccedil;&atilde;o, onde a mesma pode ser encontrada atrav&eacute;s de diversos filtros, ou a partir do momento em que a Lista de Cota&ccedil;&atilde;o foi gerada, o usu&aacute;rio ser&aacute; direcionada ao M&oacute;dulo "An&aacute;lise Cota&ccedil;&atilde;o" j&aacute; setado na lista gerada: Neste m&oacute;dulo &eacute; poss&iacute;vel imprimir novamente a lista de cota&ccedil;&atilde;o a partir do bot&atilde;o "" no Grid "Lista da Cota&ccedil;&atilde;o": Requisitos para An&aacute;lise da Cota&ccedil;&atilde;o: Para Analisar uma cota&ccedil;&atilde;o, &eacute; necess&aacute;rio que PELO MENOS UMA COTA&Ccedil;&Atilde;O POR FORNECEDOR esteja com status igual a PROCESSADO. Para que o fornecedor esteja com o status de PROCESSADO, o retorno do mesmo deve ter sido completamente preenchido: Para preencher o Retorno do Fornecedor, s&atilde;o necess&aacute;rios os seguintes dados: Tipo Frete; Tipo de pagamento; Orc. Vencimento; Qtde. Fornecedor; Pre&ccedil;o Fornecedor; Prazo Fornecedor; Caso precise informar por fornecedor, alguma observa&ccedil;&atilde;o, isso pode ser feito no momento da precifica&ccedil;&atilde;o inserindo o texto no campo &ldquo;Observa&ccedil;&otilde;es&rdquo;: Ao concluir a inser&ccedil;&atilde;o dos dados de cada fornecedor, deve-se clicar no bot&atilde;o &ldquo;Gravar&rdquo; para que suas inser&ccedil;&otilde;es ou altera&ccedil;&otilde;es sejam salvas: Para que seja feita a an&aacute;lise &eacute; necess&aacute;rio clicar no bot&atilde;o &ldquo;Analisar&rdquo;: Caso apenas um dos Fornecedores esteja apto para an&aacute;lise conforme a imagem, ser&aacute; exibida a seguinte pergunta de confirma&ccedil;&atilde;o: OBS.: Ser&aacute; poss&iacute;vel prosseguir apenas com os Fornecedores com Status &rdquo;Processado&rdquo;. Caso nenhum Fornecedor esteja apto conforme a imagem, ser&aacute; informada a seguinte mensagem: OBS.: N&atilde;o ser&aacute; poss&iacute;vel dar segmento a an&aacute;lise nesse caso. Sendo necess&aacute;rio preencher o retorno de ao menos uma cota&ccedil;&atilde;o por fornecedor. Ap&oacute;s iniciar a An&aacute;lise, ser&aacute; preciso definir a ordem de prioridade dos crit&eacute;rios (Valor, Quantidade atendida, Prazo de pagamento e Prazo de entrega): Para mudar a posi&ccedil;&atilde;o de cada crit&eacute;rio, basta arrast&aacute;-lo para o ordinal desejado como no exemplo abaixo: Perceba que no canto inferior esquerdo da janela &ldquo;Crit&eacute;rios&rdquo; da imagem a seguir, existe uma caixa de sele&ccedil;&atilde;o para salvar a &uacute;ltima posi&ccedil;&atilde;o dos crit&eacute;rios utilizados. Por&eacute;m para que seja salvo, &eacute; necess&aacute;rio clicar no bot&atilde;o &ldquo;Analisar&rdquo; (canto inferior direito): Ao clicar em &ldquo;Analisar&rdquo;, ser&aacute; apresentada a tela de analise que cont&eacute;m: (1.) Dados da lista de cota&ccedil;&atilde;o; (2.) An&aacute;lise por fornecedor de acordo aos crit&eacute;rios definidos; (3.) An&aacute;lise dos itens por fornecedor; (4.) Resumo da Cota&ccedil;&atilde;o; (1.) - Dados da lista de cota&ccedil;&atilde;o: Em &ldquo;Cota&ccedil;&atilde;o Analisada&rdquo;, os dados informados no M&oacute;dulo &ldquo;Lista Cota&ccedil;&atilde;o&rdquo; s&atilde;o exibidos para que seja poss&iacute;vel consult&aacute;-los rapidamente durante a an&aacute;lise das cota&ccedil;&otilde;es. (2.) - Cota&ccedil;&atilde;o Ganhadora: A cota&ccedil;&atilde;o do fornecedor que disp&otilde;e das melhores condi&ccedil;&otilde;es de acordo aos crit&eacute;rios definidos (Ganhador), &eacute; representado pela cor dourada na linha do Grid: No Grid da Cota&ccedil;&atilde;o Ganhadora, s&atilde;o exibidos os dados referentes ao retorno do fornecedor. Os quais s&atilde;o utilizados para realizar a an&aacute;lise com base na ordem dos crit&eacute;rios definidos: Al&eacute;m disso, caso queira analisar como o ranqueamento foi realizado pelo sistema, os pontos calculados para cada crit&eacute;rio est&atilde;o dispon&iacute;veis no lado direito do Grid: OBS.: Quando ocorre um empate em "Pontos Totais", o desempate &eacute; feito atrav&eacute;s da compara&ccedil;&atilde;o do 1&ordm; crit&eacute;rio, recebendo +1 em "Pontos totais" para aquele Fornecedor que apresentou alguma vantagem no 1&ordm; crit&eacute;rio. Caso ocorra um novo empate nessa compara&ccedil;&atilde;o, ser&aacute; feita uma nova compara&ccedil;&atilde;o no crit&eacute;rio subsequente. &Eacute; poss&iacute;vel alterar os crit&eacute;rios e reprocessar a an&aacute;lise atrav&eacute;s do bot&atilde;o &ldquo;Alterar Crit&eacute;rios&rdquo;. Ao clicar ser&aacute; exibida a janela anterior para que se defina a ordem dos crit&eacute;rios novamente: Para compreender melhor os crit&eacute;rios de an&aacute;lise e como se d&aacute; a pontua&ccedil;&atilde;o de cada fornecedor, foi disponibilizado um bot&atilde;o para exibi&ccedil;&atilde;o da documenta&ccedil;&atilde;o referente ao funcionamento da an&aacute;lise. (3.) An&aacute;lise dos itens por fornecedor: Ao selecionar determinada Cota&ccedil;&atilde;o no Grid &ldquo;Cota&ccedil;&atilde;o Ganhadora&rdquo;, ser&aacute; apresentado ao lado direito no grid &ldquo;Produtos&rdquo; a rela&ccedil;&atilde;o dos produtos atendidos ou n&atilde;o pelo fornecedor, al&eacute;m de exibir dados determinantes para a interpreta&ccedil;&atilde;o ou consulta das condi&ccedil;&otilde;es oferecidas Al&eacute;m de informar a rela&ccedil;&atilde;o de produtos daquela cota&ccedil;&atilde;o, de acordo ao retorno preenchido do mesmo, o Grid ainda demonstra de forma comparativa as outras cota&ccedil;&otilde;es, quais produtos possuem valor unit&aacute;rio menor do que a cota&ccedil;&atilde;o selecionada. Os itens que possu&iacute;rem menor valor unit&aacute;rio em outra cota&ccedil;&atilde;o, s&atilde;o representados em vermelho como aponta a legenda &ldquo;Produtos com melhor valor unit&aacute;rio em outro fornecedor&rdquo;: Para confer&ecirc;ncia, an&aacute;lise ou compara&ccedil;&atilde;o dos itens por cota&ccedil;&atilde;o, basta selecionar o item em quest&atilde;o e observar no grid inferior, a quantidade atendida, valor unit&aacute;rio e total de cada item selecionado: (4.) Resumo da Cota&ccedil;&atilde;o; No momento de gerar sua cota&ccedil;&atilde;o selecionada, &eacute; importante conferir os dados da cota&ccedil;&atilde;o para ter certeza de sua escolha. Pensando nisso, o m&oacute;dulo An&aacute;lise Cota&ccedil;&atilde;o, oferece a visualiza&ccedil;&atilde;o do &ldquo;Resumo da Cota&ccedil;&atilde;o&rdquo;, onde os dados informados no momento do retorno do fornecedor, s&atilde;o listados junto ao bot&atilde;o de Gerar Marcado: Para Gerar a cota&ccedil;&atilde;o e encaminhar os dados para o M&oacute;dulo de Pedido de Compra, basta selecionar o Fornecedor escolhido e depois clicar no bot&atilde;o &ldquo;Gerar Marcado&rdquo; : OBS.: Ao clicar em &ldquo;Gerar Marcado&rdquo; ser&aacute; perguntado se &ldquo;Deseja ir para o Pedido de Compras?&rdquo;, caso sim, ser&aacute; direcionado ao M&oacute;dulo de Pedido de Compras (Compras) com a cota&ccedil;&atilde;o selecionada: &Eacute; poss&iacute;vel visualizar no M&oacute;dulo de Pedido de Compra, se ele &eacute; proveniente de uma cota&ccedil;&atilde;o da nova rotina: Para prosseguir basta definir a forma de pagamento e ou parcelamento editando o registro: A partir da&iacute; dever&atilde;o ser realizadas as tratativas relacionadas ao pedido de compra. Q = 1649 Ap&oacute;s o desenvolvimento da rotina de Ordem de Produ&ccedil;&atilde;o, surgiu a necessidade de atribuir o tipo fiscal do produto (produto acabado, mat&eacute;ria-prima, etc.) de forma espec&iacute;fica para cada empresa no banco de dados. Tendo em vista que para efeitos fiscais, um mesmo produto pode ser classificado de maneira diferente, podendo ser considerado uma mercadoria destinada &agrave; venda em uma empresa, enquanto em outra, pode ser classificado como produto acabado. Em &ldquo;Produtos&rdquo; (Cadastro), na aba &ldquo;Fiscal&rdquo;, foi implementado o campo &ldquo;Tipo item SPED Filial&rdquo;, destinado &agrave; sele&ccedil;&atilde;o do tipo fiscal de um determinado produto para a empresa logada. O antigo campo &ldquo;Tipo item SPED&rdquo; se tornou o &ldquo;Tipo item SPED Global&rdquo;. Exemplo de funcionamento: O produto 000001 foi criado no CIEvolution em um banco de dados que possui 3 empresas vinculadas: O produto 000001 tem o &ldquo;Tipo item SPED Global&rdquo; definido como &ldquo;00 - Mercadoria para Revenda&rdquo; de maneira autom&aacute;tica, logo, as valida&ccedil;&otilde;es inerentes ao tipo fiscal do produto, em todas as empresas, ser&atilde;o os de produto para revenda. Na empresa 2, o produto 000001 teve o &ldquo;Tipo item SPED Filial&rdquo; definido como &ldquo;06 - Produto Intermedi&aacute;rio&rdquo;, logo, as valida&ccedil;&otilde;es inerentes ao tipo fiscal do produto, somente na empresa 2, ser&atilde;o os de produto intermedi&aacute;rio. Q = 1642 Na rotina "Ordem de produ&ccedil;&atilde;o", foi implementada uma valida&ccedil;&atilde;o de saldo de estoque ao adicionar o produto acabado. Agora, o sistema verifica automaticamente se h&aacute; saldo de estoque dispon&iacute;vel dos insumos relacionados ao produto. Se o saldo for insuficiente, o sistema verificar&aacute; se o usu&aacute;rio possui permiss&atilde;o concedida. Esta permiss&atilde;o &eacute; denominada "Incluir insumo com estoque negativo": Melhorias Q = 1143 Havia uma determinada lentid&atilde;o ao buscar certas quantidades de registros na Central Doc-e. O carregamento dos registros filtrados foi otimizado, consequentemente reduzindo o tempo de entrega dos dados: Q = 1672 As informa&ccedil;&otilde;es de Refer&ecirc;ncias similares localizadas anteriormente na aba "Similares" em cadastro de produto, foram realocadas para a aba "Geral", agora o Grid &ldquo;C&oacute;digo Original/Refer&ecirc;ncia&rdquo;, tem a fun&ccedil;&atilde;o de armazenar m&uacute;ltiplas refer&ecirc;ncias por produto, al&eacute;m de aceitar o mesmo c&oacute;digo em produtos diferentes: Essa funcionalidade oferece uma vantagem de consulta em um cen&aacute;rio o qual diversos produtos precisam ter um c&oacute;digo em comum para relacion&aacute;-los, os quais podem ser encontrados na busca F11 &gt; F8 (Pesquisa inteligente). Exemplo: Existem 3 varia&ccedil;&otilde;es de um produto X, essas 3 varia&ccedil;&otilde;es precisaram ser cadastradas cada uma como um produto diferente, sendo eles Pe&ccedil;a 1, Pe&ccedil;a 2 e Pe&ccedil;a 3. Os produtos Pe&ccedil;a 1, Pe&ccedil;a 2 e Pe&ccedil;a 3, possuem em comum o C&oacute;digo Original = 1122334455. Quando houver a necessidade de pesquisar os 3 itens para confer&ecirc;ncia ou compara&ccedil;&atilde;o de valor ou estoque, basta abrir a Consulta de Produtos (F11) e pressionar a tecla F8 para entrar na pesquisa inteligente: Al&eacute;m disso, quando pesquisar atrav&eacute;s da Consulta de Produtos (F11) um produto que possua "C&oacute;digo Original/Refer&ecirc;ncia" preenchido, seja a consulta feita por C&oacute;digo de Barras, Refer&ecirc;ncia, C&oacute;digo do Produto ou SKU. Ser&aacute; exibida uma aba na parte inferior da tela com o nome "C&oacute;digo Original/Refer&ecirc;ncia", onde ser&atilde;o listados os c&oacute;digos inseridos no Grid "C&oacute;digo Original/Refer&ecirc;ncia" do produto filtrado: Q = 1647 No m&oacute;dulo &ldquo;Produtos&rdquo; (Cadastro), as entradas dos produtos acabados e as sa&iacute;das dos produtos mat&eacute;rias-primas v&atilde;o constar na aba &ldquo;Movimenta&ccedil;&atilde;o&rdquo;, a partir das opera&ccedil;&otilde;es feitas em &ldquo;Ordem de Produ&ccedil;&atilde;o&rdquo;: Q = 1648 O custo de aquisi&ccedil;&atilde;o de um produto acabado ser&aacute; atualizado sempre que a Ordem de Produ&ccedil;&atilde;o deste determinado produto for conclu&iacute;da. Q = 1586 Ao adicionar um produto &agrave; ordem de produ&ccedil;&atilde;o, uma tela &eacute; aberta para selecionar a quantidade. Foram implementadas melhorias nesta tela: Adicionada a quantidade de estoque dispon&iacute;vel; Se a quantidade utilizada for maior que a quantidade dispon&iacute;vel, a cor da fonte mudar&aacute; para vermelho; Foi adicionada uma valida&ccedil;&atilde;o para evitar a inclus&atilde;o de produtos quando algum insumo n&atilde;o tiver quantidade suficiente. Corre&ccedil;&otilde;es Q = 1524 Anteriormente, a valida&ccedil;&atilde;o da remo&ccedil;&atilde;o do SKU, s&oacute; ocorria na empresa configurada para a sua utiliza&ccedil;&atilde;o. Logo o SKU de um determinado produto poderia ser removido ao trocar de filial e realizar a remo&ccedil;&atilde;o no cadastro de produtos. Essa vulnerabilidade foi corrigida, agora n&atilde;o &eacute; mais poss&iacute;vel remover o SKU de nenhum produto enquanto houver vinculo do sistema com o Wemov. Q = 1673 Devido a altera&ccedil;&atilde;o na tratativa dos c&oacute;digos de barras para m&uacute;ltiplos c&oacute;digos de barras, havia um erro que permitia definir um campo de c&oacute;digo de barras vazio como c&oacute;digo padr&atilde;o da etiqueta. Esse bug foi corrigido, agora n&atilde;o &eacute; poss&iacute;vel marcar como padr&atilde;o sem ter o campo c&oacute;digo de barras preenchido. Antes: Depois: Q = 1689 Na rotina &ldquo;Ordem de Produ&ccedil;&atilde;o&rdquo;, em determinadas situa&ccedil;&otilde;es, ao clicar no &iacute;cone de exclus&atilde;o &ldquo;&rdquo; de um produto no grid &ldquo;Produto acabado&rdquo;, nada acontecia. Agora surgir&aacute; uma valida&ccedil;&atilde;o de confirma&ccedil;&atilde;o da exclus&atilde;o de um determinado item da ordem de produ&ccedil;&atilde;o. Q = 1617 Havia uma falha em localizar um produto espec&iacute;fico atrav&eacute;s da fun&ccedil;&atilde;o de pesquisa inteligente, especialmente quando o c&oacute;digo do produto inclu&iacute;a caracteres alfab&eacute;ticos. Esta quest&atilde;o surgia apenas quando as letras estavam presentes no c&oacute;digo do produto. S = 28080 Havia uma falha na consulta avan&ccedil;ada de produtos (F11), onde ao selecionar qualquer filtro no segundo campo dispon&iacute;vel para pesquisa, os resultados retornados eram sempre para o filtro "Refer&ecirc;ncia". S = 32410 No m&oacute;dulo &ldquo;Pedido de compra&rdquo;, dentro da &ldquo;Procura de Produtos&rdquo; (F8), aba &ldquo;&Uacute;ltimas Compras&rdquo;, haviam falhas visuais nos t&iacute;tulos dos campos de data de lan&ccedil;amento e valor do frete da nota, como tamb&eacute;m n&atilde;o informava nenhum valor nesses campos, mesmo que houvesse. S = 32338 A auto associa&ccedil;&atilde;o/cadastro de produtos na importa&ccedil;&atilde;o de XML em &ldquo;Notas Fiscais de Entrada&rdquo; estava retornando a mensagem: "C&oacute;digo de barras SEM GTIN n&atilde;o pode ter letra!&rdquo;. Essa mensagem ocorria devido ao fato do CIEvolution possuir uma valida&ccedil;&atilde;o que n&atilde;o permite inserir Letras no campo de c&oacute;digo de barras no cadastro do produto, tendo em vista que, quando um item do XML da nota fiscal n&atilde;o possui c&oacute;digo de barras, logo, a tag &ldquo;cEAN&rdquo; &eacute; preenchida com &ldquo;SEM GTIN&rdquo;. A valida&ccedil;&atilde;o foi ajustada para n&atilde;o preencher o campo c&oacute;digo de barras do cadastro do produto quando a tag &ldquo;cEAN&rdquo; do XML for preenchida com &ldquo;SEM GTIN&rdquo;. Informa&ccedil;&otilde;es para o Suporte: Na Consulta de produtos (F11) &gt; Pesquisa Inteligente (F8), existe um conflito caso em alguma circunst&acirc;ncia o c&oacute;digo de barras seja semelhante ao C&oacute;digo Original, pois ao utilizar a pesquisa inteligente que n&atilde;o utiliza filtros definidos, a busca no c&oacute;digo de barras ocorre antes da busca do C&oacute;digo Original. Isso pode ocorrer com os demais filtros v&aacute;lidos na pesquisa inteligente. Depois de gerar a lista:&nbsp; Antes de gerar a lista: Ao gerar determinada Lista, o Grid fornecedores disponibilizar&aacute; o uso da coluna de impress&atilde;o de rela&ccedil;&atilde;o de itens por fornecedor: Ap&oacute;s preencher os dados necess&aacute;rios, &eacute; preciso Gerar a Cota&ccedil;&atilde;o para prosseguir para a An&aacute;lise. Isso &eacute; feito clicando sobre o bot&atilde;o &ldquo;Gerar Cota&ccedil;&atilde;o&rdquo;: OBS.: Caso queira criar a lista por&eacute;m devido a alguma emin&ecirc;ncia de adicionar, modificar ou excluir determinado dado, n&atilde;o queira gerar mas apenas salvar, &eacute; poss&iacute;vel. Quando necess&aacute;rio, caso a Lista n&atilde;o tenha sido gerada pode-se retornar ao registro e editar de acordo a sua prefer&ecirc;ncia. Ap&oacute;s Gerado o registro da Lista De Cota&ccedil;&atilde;o, n&atilde;o &eacute; poss&iacute;vel mais alter&aacute;-lo. Para imprimir a lista de cota&ccedil;&atilde;o, informando os Fornecedores e a rela&ccedil;&atilde;o de itens, &eacute; preciso clicar no bot&atilde;o de impress&atilde;o do M&oacute;dulo "Lista de Cota&ccedil;&atilde;o": A impress&atilde;o da Lista de Cota&ccedil;&atilde;o ser&aacute; exibida no seguinte modelo: Ao gerar determinada Lista, o Grid fornecedores disponibilizar&aacute; o uso da coluna de impress&atilde;o de rela&ccedil;&atilde;o de itens por fornecedor: Antes de gerar a lista: Depois de gerar a lista: A impress&atilde;o do Grid Fornecedores foi implementada com o objetivo de prover ao respons&aacute;vel pela cota&ccedil;&atilde;o, uma rela&ccedil;&atilde;o para cada fornecedor. Ou seja, cada vez que for necess&aacute;rio enviar a lista da cota&ccedil;&atilde;o para determinado fornecedor, ser&aacute; preciso clicar na impress&atilde;o daquele fornecedor. Logo o sistema ir&aacute; trazer uma lista no seguinte modelo: A partir do momento em que a Lista de Cota&ccedil;&atilde;o foi gerada, deve-se dar segmento por meio do M&oacute;dulo "An&aacute;lise Cota&ccedil;&atilde;o". As cota&ccedil;&otilde;es Geradas s&atilde;o exibidas no m&oacute;dulo An&aacute;lise Cota&ccedil;&atilde;o, onde a mesma pode ser encontrada atrav&eacute;s de diversos filtros, ou a partir do momento em que a Lista de Cota&ccedil;&atilde;o foi gerada, o usu&aacute;rio ser&aacute; direcionada ao M&oacute;dulo "An&aacute;lise Cota&ccedil;&atilde;o" j&aacute; setado na lista gerada: Neste m&oacute;dulo &eacute; poss&iacute;vel imprimir novamente a lista de cota&ccedil;&atilde;o a partir do bot&atilde;o "" no Grid "Lista da Cota&ccedil;&atilde;o": Requisitos para An&aacute;lise da Cota&ccedil;&atilde;o: Para Analisar uma cota&ccedil;&atilde;o, &eacute; necess&aacute;rio que PELO MENOS UMA COTA&Ccedil;&Atilde;O POR FORNECEDOR esteja com status igual a PROCESSADO. Para que o fornecedor esteja com o status de PROCESSADO, o retorno do mesmo deve ter sido completamente preenchido: Inserir atrav&eacute;s da inser&ccedil;&atilde;o padr&atilde;o pelo grid: Obs.: O atalho para o uso da ferramenta se encontra na tecla F4. Ap&oacute;s preencher os dados necess&aacute;rios, &eacute; preciso Gerar a Cota&ccedil;&atilde;o para prosseguir para a An&aacute;lise. Isso &eacute; feito clicando sobre o bot&atilde;o &ldquo;Gerar Cota&ccedil;&atilde;o&rdquo;: OBS.: Caso queira criar a lista, por&eacute;m devido a alguma emin&ecirc;ncia de adicionar, modificar ou excluir determinado dado, n&atilde;o queira gerar mas apenas salvar, &eacute; poss&iacute;vel. Quando necess&aacute;rio, caso a Lista n&atilde;o tenha sido gerada pode-se retornar ao registro e editar de acordo a sua prefer&ecirc;ncia. Ap&oacute;s Gerado o registro da Lista De Cota&ccedil;&atilde;o, n&atilde;o &eacute; poss&iacute;vel mais alter&aacute;-lo. Para&nbsp;imprimir a lista de cota&ccedil;&atilde;o, informando os Fornecedores e a rela&ccedil;&atilde;o de itens, &eacute; preciso clicar no bot&atilde;o de impress&atilde;o do M&oacute;dulo "Lista de Cota&ccedil;&atilde;o":</div>
