<div style="position: relative; width: 100%; height: 0; padding-top: 56.2500%; padding-bottom: 0; box-shadow: 0 2px 8px 0 rgba(63,69,81,0.16); margin-top: 1.6em; margin-bottom: 0.9em; overflow: hidden; border-radius: 8px; will-change: transform;"><iframe style="position: absolute; width: 100%; height: 100%; top: 0; left: 0; border: none; padding: 0; margin: 0;" src="https://www.canva.com/design/DAF7q28ZWoY/view?embed" width="300" height="150" allowfullscreen="allowfullscreen">
  </iframe></div>
<div hidden="">Conceito Inteligente Evolution 7.2.5 Implementa&ccedil;&otilde;es WMS: Integra&ccedil;&atilde;o com sistemas de gest&atilde;o de estoque; Cadastro de Produtos: Novas valida&ccedil;&otilde;es quanto ao SKU; Tributa&ccedil;&atilde;o por UF/Dados Fiscais Produtos: Regras fiscais de uso e consumo para contribuintes; SPED Fiscal: Novo leiaute de 2024. Melhorias Tributa&ccedil;&atilde;o por UF: Mudan&ccedil;a na tratativa de al&iacute;quotas de ICMS para Estados de destino. Corre&ccedil;&otilde;es Border&ocirc; Banc&aacute;rio: Falha na filtragem de t&iacute;tulos para inserir na remessa; Dados Fiscais Produtos: UFs mostradas em duplicidade. S = Ticket Q = Issue Implementa&ccedil;&otilde;es Q = 1401 O Warehouse Management System (WMS) ou Sistema de Gerenciamento de Armaz&eacute;m, &eacute; uma solu&ccedil;&atilde;o de controle de estoque que se adapta a diversos tipos de armaz&eacute;ns e ajuda a controlar cada etapa do fluxo dos produtos e das atividades no armaz&eacute;m da empresa. Atividades, como recebimento, armazenamento, prepara&ccedil;&atilde;o e separa&ccedil;&atilde;o de pedidos at&eacute; a confer&ecirc;ncia da expedi&ccedil;&atilde;o s&atilde;o poss&iacute;veis com o WMS. A integra&ccedil;&atilde;o com WMS permite que o CIEvolution disponibilize aos usu&aacute;rios a possibilidade de utilizarem ferramentas WMS de terceiros para gerenciar o estoque dos seus armaz&eacute;ns. A primeira ferramenta integrada &eacute; a Wemov. Como funciona? Todo documento de sa&iacute;da faturado ter&aacute; uma ordem de separa&ccedil;&atilde;o enviada (Atrav&eacute;s do CIDOC-e) &agrave; plataforma da Wemov, dessa forma, o usu&aacute;rio dessa plataforma poder&aacute; proceder com a separa&ccedil;&atilde;o dos itens desse documento para a entrega. Assim como as sa&iacute;das, os documentos de entrada gerados tamb&eacute;m v&atilde;o gerar ordens de recebimento para a Wemov, onde o usu&aacute;rio poder&aacute; fazer o recebimento dos itens do documento no armaz&eacute;m. Outra tarefa do CIEvolution &eacute; fornecer os cadastros de produtos, locais de estoque, unidades, grupos e subgrupos para as ordens funcionarem corretamente na plataforma da Wemov. Para que a Wemov seja integrada ao CIEvolution, se faz necess&aacute;rio que as credenciais de acesso sejam geradas pela Wemov para a empresa contratante, ap&oacute;s isso, devem ser feitas algumas configura&ccedil;&otilde;es que ser&atilde;o mostradas a seguir. CIEvolution e Wemov No m&oacute;dulo "Par&acirc;metros de Integra&ccedil;&otilde;es" (Menu "Sistema") foram criados campos para receber as credenciais geradas pela Wemov. Essas credenciais permitem que o CIEvolution se comunique com o banco de dados da empresa dentro da plataforma Wemov: O envio dos cadastros citados anteriormente &eacute; feito, primeiramente, atrav&eacute;s do envio da carga inicial que &eacute; executado pelo bot&atilde;o "Envio Inicial", presente ao lado dos campos de credencial do WMS: Obs.: Os locais de estoque n&atilde;o ser&atilde;o enviados no "Envio Inicial". Obs. 2: O bot&atilde;o "Envio Inicial" tanto sincroniza os cadastros com a Wemov, como atualiza esses cadastros (caso j&aacute; tenham sido sincronizados). O m&oacute;dulo "Locais de Estoque" sofreu uma modifica&ccedil;&atilde;o a qual consiste em uma nova op&ccedil;&atilde;o que permite enviar um determinado cadastro de local de estoque para a plataforma da Wemov. Dentro do cadastro de um determinado local de estoque, ao clicar no bot&atilde;o "Op&ccedil;&otilde;es", a op&ccedil;&atilde;o "Enviar local para WMS" ser&aacute; disponibilizada. Essa op&ccedil;&atilde;o deve ser obrigatoriamente utilizada ap&oacute;s a conclus&atilde;o do "Envio Inicial". Obs.: A op&ccedil;&atilde;o s&oacute; ficar&aacute; dispon&iacute;vel para empresas com credenciais do Wemov preenchidas em "Par&acirc;metros de Integra&ccedil;&otilde;es". Obs. 2: O "Envio Inicial" vai ser finalizado quando o &uacute;ltimo produto for sincronizado. &Eacute; poss&iacute;vel visualizar o andamento da sincroniza&ccedil;&atilde;o pelo log do CIDOC-e. Comportamentos da integra&ccedil;&atilde;o A integra&ccedil;&atilde;o do WMS Wemov com o CIEvolution tem particularidades que devem ser abordadas: Novos cadastros: Toda vez que for criado um cadastro de produto, unidade, grupo ou subgrupo, este ser&aacute; vinculado imediatamente ao Wemov; Obs.: Somente produtos com preenchimento no campo SKU ser&atilde;o vinculados ao Wemov. Obs. 2: Al&eacute;m do "Envio Inicial", os locais de estoque podem ser sincronizados junto com a emiss&atilde;o de uma ordem. Edi&ccedil;&atilde;o de cadastros: Os cadastros de produtos, unidades, grupos, subgrupos e locais de estoque (sincronizados) ser&atilde;o atualizados sempre que houver uma mudan&ccedil;a no cadastro dessas determinadas entidades. Exemplo: Se o cadastro de um produto obtiver a descri&ccedil;&atilde;o modificada no CIEvolution, automaticamente esse item ser&aacute; atualizado na plataforma da Wemov; Envio de ordens de sa&iacute;da: Sempre que for faturado um documento de sa&iacute;da (Pedidos/or&ccedil;amentos, Notas Fiscais Diversas/ Agrupamento de pedidos), ser&aacute; enviada uma ordem de separa&ccedil;&atilde;o ao Wemov referente ao documento faturado; Obs.: Os documentos gerados pelas rotinas "Assistente Fiscal" e "NF's" (Agrupamentos) n&atilde;o v&atilde;o enviar eventos de ordens. Envio de ordens de entrada: Sempre que for gerado um documento de entrada (Notas Fiscais de Entrada), ser&aacute; enviada uma ordem de recebimento ao Wemov referente ao documento gerado. Obs.: Caso o CFOP ou o documento item estejam com o campo "Calcula Estoque" ou "C&aacute;lc. Estoque" como "N&atilde;o", n&atilde;o ser&aacute; enviada uma ordem de entrada ou sa&iacute;da. Central Wemov Para monitorar as atividades da integra&ccedil;&atilde;o, foi desenvolvida a "Central Wemov" (Menu "Fiscal") que permite visualizar as ordens de sa&iacute;da e entrada enviadas ao Wemov, bem como seus status e detalhes das ordens: Detalhes da central: Filtros multifuncionais: Per&iacute;odo de cria&ccedil;&atilde;o das ordens: Modelo: Permite escolher qual o tipo de opera&ccedil;&atilde;o a ser monitorada: Status das ordens: Todas: Demonstra todas as ordens de um determinado per&iacute;odo de acordo com o modelo; Entrada criada e Sa&iacute;da criada: Mostra as ordens criadas e n&atilde;o sincronizadas ao Wemov (depende do modelo selecionado); Aguardando: Indica que o recebimento da ordem de entrada est&aacute; pendente; Recebendo: O recebimento da ordem de entrada est&aacute; em andamento; Recebido: O recebimento foi conclu&iacute;do na Wemov; Cancelado: Ordem de entrada ou sa&iacute;da cancelada na plataforma do Wemov; Separa&ccedil;&atilde;o pendente: A ordem de sa&iacute;da est&aacute; pendente de separa&ccedil;&atilde;o na Wemov; Em andamento: A separa&ccedil;&atilde;o da ordem foi iniciada; Separa&ccedil;&atilde;o conclu&iacute;da/Expedi&ccedil;&atilde;o pendente: A ordem de separa&ccedil;&atilde;o foi conclu&iacute;da e est&aacute; pendente de expedi&ccedil;&atilde;o; Expedi&ccedil;&atilde;o em andamento: A expedi&ccedil;&atilde;o da ordem de sa&iacute;da foi iniciada; Expedi&ccedil;&atilde;o conclu&iacute;da: Todo o processo da ordem de sa&iacute;da foi encerrado. Documento: Filtra uma ordem especifica pelo n&uacute;mero do documento: A listagem de ordens se d&aacute; na aba "Documentos Fiscais", esta possui as seguintes colunas: Status: Mostra o status de cada ordem; Ordem Id: Refere-se ao n&uacute;mero de identifica&ccedil;&atilde;o da ordem; Documento: N&uacute;mero do documento atrelado &agrave; ordem; Num. pedido: N&uacute;mero do pedido vinculado ao documento/ordem; Data cria&ccedil;&atilde;o: Data em que foi gerada a ordem; Data e hora de sa&iacute;da: Data e hora que a expedi&ccedil;&atilde;o entra em andamento; Data de recebimento: Data que o recebimento da ordem de entrada &eacute; conclu&iacute;da; Data atualiza&ccedil;&atilde;o: Mostra a data da &uacute;ltima atualiza&ccedil;&atilde;o de status; Empresa: N&uacute;mero da empresa que enviou a ordem; C&oacute;d. Local: C&oacute;digo do local de estoque relacionado com a ordem; Local de estoque: Descri&ccedil;&atilde;o do cadastro do local de estoque. Caracter&iacute;sticas das colunas na listagem de itens da ordem: C&oacute;d. Produto: C&oacute;digo interno do produto no CIEvolution; Ordem Id: Refere-se ao n&uacute;mero de identifica&ccedil;&atilde;o da ordem a qual o item pertence; Descri&ccedil;&atilde;o: Descri&ccedil;&atilde;o do cadastro do produto; Quant. Pendente: Vai mostrar a quantidade pendente de separa&ccedil;&atilde;o do item; Quant. Separada: Quantidade separada do item; Quant. Recebida: Quantidade recebida de itens nas ordens de entrega; Quant.: Quantidade do item no documento. Por se tratar de eventos enviados atrav&eacute;s do CIDOC-e, foi desenvolvido um mecanismo de notifica&ccedil;&atilde;o em casos de falhas nos envios de ordens, etc. Quando houver alguma falha de envio, um bal&atilde;o de notifica&ccedil;&atilde;o vai surgir, similar ao que acontece com a notifica&ccedil;&atilde;o de notas fiscais: Ao clicar na mensagem do bal&atilde;o, a aba "Notifica&ccedil;&otilde;es" se abrir&aacute; e ser&aacute; poss&iacute;vel visualizar os ordens com erros. Cada evento possui uma mensagem de erro especifica. O reenvio do evento pode ser realizado ao clicar no bot&atilde;o "Marcar como resolvido": Extra: As notifica&ccedil;&otilde;es s&oacute; v&atilde;o surgir para a empresa vinculada ao Wemov. Outras regras N&atilde;o ser&aacute; poss&iacute;vel inserir credenciais de acesso ao Wemov em mais de uma empresa no CIEvolution: Q = 1523 Devido ao fato da Wemov precisar que os produtos tenham SKU em seus cadastros, foram criadas algumas valida&ccedil;&otilde;es quando a empresa estiver vinculada ao Wemov (credenciais em "Par&acirc;metros de Integra&ccedil;&otilde;es): Em Produtos (Menu "Cadastros"), ao gravar o cadastro de um produto e este n&atilde;o possuir um SKU (aba "Armaz&eacute;m") preenchido, uma confirma&ccedil;&atilde;o vai surgir informando que o item n&atilde;o vai ser sincronizado com o Wemov: Quando o cadastro de um produto j&aacute; obtiver o campo SKU preenchido e houver uma tentativa de remov&ecirc;-lo, ao tentar gravar o registro vai surgir uma mensagem impedindo a continuidade do processo, pois, j&aacute; havia uma rela&ccedil;&atilde;o entre o item e o Wemov, logo, n&atilde;o ser&aacute; poss&iacute;vel remover o SKU: Q = 1325 Atualmente, as regras fiscais e CFOPs s&atilde;o associadas para contribuintes de ICMS somente em opera&ccedil;&otilde;es de revenda, embora o CIEvolution n&atilde;o esteja com esses descritivos. Outra fun&ccedil;&atilde;o que existe no CIEvolution &eacute; a op&ccedil;&atilde;o de "Uso e Consumo", recurso utilizado apenas como gatilho para calcular a substitui&ccedil;&atilde;o tribut&aacute;ria por pauta nas opera&ccedil;&otilde;es para contribuintes. Devido a possibilidade de haver opera&ccedil;&otilde;es de "uso de consumo" para contribuintes de ICMS, foi implementado um novo meio de definir regras fiscais para essas opera&ccedil;&otilde;es. Os m&oacute;dulos "Tributa&ccedil;&atilde;o por UF" e "Dados Fiscais Produtos" foram reformuladas para disponibilizar a possibilidade de definir regras fiscais para opera&ccedil;&otilde;es de "uso e consumo". Tributa&ccedil;&atilde;o por UF: Foram inseridas novas colunas para definir o CFOP e a "Tabela de Tributa&ccedil;&atilde;o" que ser&atilde;o vinculadas em opera&ccedil;&otilde;es de "uso de consumo" para Estados diferentes da empresa logada: Dados Fiscais Produtos: Os termos "Tributa&ccedil;&atilde;o para n&atilde;o contribuintes" e "Tributa&ccedil;&atilde;o para Contribuintes" dos grupos foram trocados para "Consumidor Final" e "Contribuinte". Dentro de "Consumidor Final" continua a mesma defini&ccedil;&atilde;o de uma regra fiscal em opera&ccedil;&otilde;es para consumidor final. J&aacute; em "Contribuinte", agora &eacute; poss&iacute;vel definir regras fiscais para opera&ccedil;&otilde;es de "revenda" e "Uso e consumo" em opera&ccedil;&otilde;es para contribuintes de ICMS: Na pr&aacute;tica, caso a opera&ccedil;&atilde;o seja de uso e consumo para contribuinte, &eacute; necess&aacute;rio marcar a op&ccedil;&atilde;o "Uso e Consumo" que vai aparecer quando for inserido um parceiro contribuinte de ICMS na opera&ccedil;&atilde;o: Q = 1525 Foi implementado o novo leiaute 018 para o ano de 2024 no EFD Fiscal. Melhorias Q = 1454 Atualmente, o CIEvolution realiza o c&aacute;lculo do Diferencial de Al&iacute;quota do ICMS (DIFAL) com base em duas al&iacute;quotas: a al&iacute;quota interna da Unidade Federativa (UF) de destino da opera&ccedil;&atilde;o e a al&iacute;quota interestadual da UF emitente. Estas al&iacute;quotas s&atilde;o configuradas no m&oacute;dulo "Tabela de Tributa&ccedil;&atilde;o". No entanto, surge um desafio, pois, diversos Estados est&atilde;o passando por ajustes em suas al&iacute;quotas internas e tecnicamente se faz necess&aacute;rio que todas as empresas efetuem a atualiza&ccedil;&atilde;o de cada al&iacute;quota no campo "% ICMS Interna da UF do Destinat&aacute;rio" de cada uma "tabela de tributa&ccedil;&atilde;o" no CIEvolution, ajustando as al&iacute;quotas conforme as novas regras de cada Estado. Devido ao fato das al&iacute;quotas internas de ICMS serem ajustadas frequentemente, foram feitos alguns ajustes no CIEvolution para facilitar a atualiza&ccedil;&atilde;o das al&iacute;quotas: Dentro do m&oacute;dulo "Tributa&ccedil;&atilde;o por UF", foi criada uma nova aba chamada "Vig&ecirc;ncia" a qual disponibiliza os campos "Data Inicio" e "Al&iacute;q. ICMS interna". A fun&ccedil;&atilde;o desses novos campos &eacute; definir quando e qual percentual de al&iacute;quota de ICMS interna do destinat&aacute;rio entrar&aacute; em vigor, exemplo: Como pode ser visto, a partir do dia 01/01/2024 os c&aacute;lculos e regras fiscais utilizar&atilde;o a al&iacute;quota de 20,5% em opera&ccedil;&otilde;es que a UF de destino seja "BA". Dessa forma, &eacute; poss&iacute;vel definir diretamente nas UFs de destino qual ser&aacute; a al&iacute;quota interna de ICMS, evitando a dificuldade de modificar cada "tabela de tributa&ccedil;&atilde;o". Obs.: Se n&atilde;o houver preenchimento desses novos campos, a al&iacute;quota do campo "% ICMS Interna da UF do Destinat&aacute;rio" no m&oacute;dulo "Tabela de tributa&ccedil;&atilde;o" ser&aacute; considerada. Corre&ccedil;&otilde;es Q = 1458 No m&oacute;dulo "Border&ocirc; Banc&aacute;rio" (Financeiro - Contas a Receber) &eacute; poss&iacute;vel inserir t&iacute;tulos de forma manual em uma remessa aberta. Havia um erro que ocorria ao clicar no bot&atilde;o "Filtrar". Q = 1422 Em "Dados Fiscais Produtos" (Cadastro - Fiscal), a lista de Estados dentro do campo "UF" listava, incorretamente, os Estados por empresa, logo, se houvesse 5 empresas no banco de dados, cada UF seria listada 5 vezes.</div>
