<div style="position: relative; width: 100%; height: 0; padding-top: 56.2500%; padding-bottom: 0; box-shadow: 0 2px 8px 0 rgba(63,69,81,0.16); margin-top: 1.6em; margin-bottom: 0.9em; overflow: hidden; border-radius: 8px; will-change: transform;"><iframe style="position: absolute; width: 100%; height: 100%; top: 0; left: 0; border: none; padding: 0; margin: 0;" src="https://www.canva.com/design/DAGRM1jfFHE/bqyaXr8YBqmVJ8CD1OfQxw/view?embed" width="300" height="150" allowfullscreen="allowfullscreen">
  </iframe></div>
<div hidden="">Conceito Inteligente Evolution v7.3.8&nbsp; Novidades: Contas banc&aacute;rias: Taxa de boleto associada &agrave;s Despesas Acess&oacute;rias;&nbsp; Border&ocirc; Banc&aacute;rio: Implementa&ccedil;&atilde;o de valida&ccedil;&atilde;o no processamento; Corre&ccedil;&otilde;es: Border&ocirc; Banc&aacute;rio: Falha no carregamento de border&ocirc;s banc&aacute;rios em aberto; &nbsp; Novidades S = 33381&nbsp; O CIEvolution agora possui um recurso que vai inserir a tarifa do boleto banc&aacute;rio na composi&ccedil;&atilde;o do valor de Despesas Acess&oacute;rias de um documento, em opera&ccedil;&otilde;es que utilizem boletos banc&aacute;rios com taxa de boleto configurada.&nbsp; Atualmente, o CIEvolution acresce o valor definido na &ldquo;Taxa Boleto R$&rdquo; (Contas banc&aacute;rias) em cada parcela emitida em uma opera&ccedil;&atilde;o com o respectivo boleto. A partir dessa vers&atilde;o, ser&aacute; poss&iacute;vel definir se a Taxa Boleto R$ (tarifa) vai ser atribu&iacute;da por parcela ou por documento emitido, assim como, este valor vai compor as Despesas Acess&oacute;rias da nota fiscal emitida.&nbsp; Aten&ccedil;&atilde;o: Entre em contato com o suporte para fazer as devidas configura&ccedil;&otilde;es.&nbsp; Para que essa melhoria fosse poss&iacute;vel, m&uacute;ltiplos ajustes foram feitos no CIEvolution: Em &ldquo;Pedidos/Or&ccedil;amentos&rdquo; foi implementada a aba &ldquo;Impostos&rdquo;, essa aba &eacute; respons&aacute;vel por mostrar os impostos que est&atilde;o compondo aquela venda. O &ldquo;Resumo&rdquo; tamb&eacute;m foi melhorado para mostrar os valores que incidem sobre o total da venda, trazendo mais informa&ccedil;&otilde;es para o usu&aacute;rio:&nbsp; &nbsp; &nbsp;Al&eacute;m da aba, as despesas acess&oacute;rias tamb&eacute;m ser&atilde;o exibidas em um campo no pr&oacute;prio item;&nbsp; Alguns ajustes foram feitos na op&ccedil;&atilde;o Parcelamento manual:&nbsp; &nbsp; &nbsp; O campo de sele&ccedil;&atilde;o de forma de pagamento foi posicionado como primeiro campo;&nbsp; Foi implementado um campo para exibir o valor da taxa, desconto ou acr&eacute;scimo. &nbsp;Foi implementado o campo de Despesas Acess&oacute;rias Em Notas Fiscais Diversas.&nbsp; Q = 2067 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Foi implementada uma valida&ccedil;&atilde;o que vai exigir a confirma&ccedil;&atilde;o (por parte do usu&aacute;rio) do processamento dos arquivos de retorno de border&ocirc;s banc&aacute;rios. &nbsp; Corre&ccedil;&otilde;es Q = 2063 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Ao abrir o m&oacute;dulo Border&ocirc; Banc&aacute;rio, mesmo havendo v&aacute;rios border&ocirc;s em aberto, somente um era carregado automaticamente. Foi feita uma corre&ccedil;&atilde;o para carregar todos os border&ocirc;s em aberto, assim que a rotina for aberta.</div>
